[{"data":1,"prerenderedAt":53},["ShallowReactive",2],{"content-query-2ksaDQTQmO":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":47,"_id":48,"_source":49,"_file":50,"_stem":51,"_extension":52},"/blog/love-and-passion","blog",false,"","Love and Passion","Been a while, I posted anything. So thought of dropping some thing on love and\npassion. We all grow up trying to understand what love is and what it  means.\nWe stumble upon attraction and then slowly grow to understand layers of\nemotions and layers of complexity within it.","tag:blogger.com,1999:blog-8061911113731935185.post-3499278539196349504","love-and-passion","2012-02-05T07:28:00.000-08:00","post",{"type":15,"children":16,"toc":44},"root",[17,24,29,34,39],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27],{"type":23,"value":28},"Then we start pondering upon the existence of True Love. Does it exist? I\nremember one of my friend asking me if it really exists like the ones in\nstories and movies. Lately, I have come to realize that it certainly does\nexist. But not in a sense of a girl and a boy, but more in the perspective of\nlife.",{"type":18,"tag":19,"props":30,"children":31},{},[32],{"type":23,"value":33},"To understand, we have to see what it means to be in love. I simply think it\nis the passion and nothing else. Having a passion is a real thing and not\nmade-up. People have passion for lot of things and pursue them to eternity. We\nhave heard of it from our history. Passionate people either changing the\nworld.",{"type":18,"tag":19,"props":35,"children":36},{},[37],{"type":23,"value":38},"So if you are passionate about something, you are in love with it. Its your\nlife. So yes True Love does exist. The existence of emotion is real and\nauthentic. Similarly love between people could also be very real, to identify\nit, you simply have to ask if you are passionate - thats all. You are\npassionate about something because it makes you feel happy, and gives you a\nreason to live on. Some people find their passion in what they do, some people\nfind passion in some other people.",{"type":18,"tag":19,"props":40,"children":41},{},[42],{"type":23,"value":43},"Passion is the foundation of love.",{"title":7,"searchDepth":45,"depth":45,"links":46},2,[],"markdown","content:blog:love-and-passion.md","content","blog/love-and-passion.md","blog/love-and-passion","md",1719977874637]