[{"data":1,"prerenderedAt":205},["ShallowReactive",2],{"content-query-47KRpnJ0pb":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":199,"_id":200,"_source":201,"_file":202,"_stem":203,"_extension":204},"/blog/the-fountain-head-and-steve-jobs","blog",false,"","The Fountain Head and Steve Jobs","I have been following this persona for quite a while, not because I own one of\nhis products or that I find him god like. But simply because I find his\ncharacter interesting and the decision he makes intriguing.","tag:blogger.com,1999:blog-8061911113731935185.post-8795600449022345345","the-fountain-head-and-steve-jobs","2010-09-05T15:22:00.000-07:00","post",{"type":15,"children":16,"toc":196},"root",[17,24,46,51,56,61,66,71,76,81,86,91,104,118,128,138,155,167,177,191],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27,29,37,39,44],{"type":23,"value":28},"[![](",{"type":18,"tag":30,"props":31,"children":35},"a",{"href":32,"rel":33},"http://t0.gstatic.com/images?q=tbn:ANd9GcTkfjXbQyWIGR-",[34],"nofollow",[36],{"type":23,"value":32},{"type":23,"value":38},"\nhMYh79Dj0-SY5XyE90_Vy6PFD9t8cWJJmSn0&t=1&usg=__M1onqCc60p7NcENbX7oIL1tgP-8=)](",{"type":18,"tag":30,"props":40,"children":42},{"href":32,"rel":41},[34],[43],{"type":23,"value":32},{"type":23,"value":45},"\nhMYh79Dj0-SY5XyE90_Vy6PFD9t8cWJJmSn0&t=1&usg=__M1onqCc60p7NcENbX7oIL1tgP-8=)",{"type":18,"tag":19,"props":47,"children":48},{},[49],{"type":23,"value":50},"Long time back I had read a novel  by Anny Rand (The Fountain Head), the main\nprotagonist of the novel - Howard Roark is an individualist who has high value\nfor human integrity. He is also an architect which gives him more reasons to\nhave those values. The whole story is a conflict between the ideas and value\nof human.",{"type":18,"tag":19,"props":52,"children":53},{},[54],{"type":23,"value":55},"In overall perspective, it is a battle between objectivism and collectivism.\nThe story also has other 5 strong characters with different ideology. Some are\nsalve to society, some are manipulator, some are lost, some are broken and\nsome are as strong as steal.",{"type":18,"tag":19,"props":57,"children":58},{},[59],{"type":23,"value":60},"This was also the novel which pushed me to contemplate about the effect of\nmedia over human and how they are influenced to position themselves. I could\nnot help reminding myself of the conflict between the artist and critics which\nthe novel has portrayed. After, years of my journey into entrepreneurship I\nstill face those challenges of justifying decisions. Obviously, which can be\nmocked by many ideology.",{"type":18,"tag":19,"props":62,"children":63},{},[64],{"type":23,"value":65},"The story and the philosophy had a strong influence on me too. It also had to\ndo with the fact, the time I was reading this novel I was going through a lot\nof personal conflict. It was hard for me to put aside the story and its\nconsequences. But since then, I have started to have my own perspective of the\ncase and have somehow come to an equilibrium.",{"type":18,"tag":19,"props":67,"children":68},{},[69],{"type":23,"value":70},"I have an impromptu characteristic, usually I make my decision on a blink of\nan eye. Sometime I feel I know what I like and what I don't instantly. It was\non year 2009 that I stumbled upon Steve Job and was immediately pulled into\nhis character.",{"type":18,"tag":19,"props":72,"children":73},{},[74],{"type":23,"value":75},"Before that I hardly knew about Apple, though I was familiar with Macintosh\nand iPod, I had never cared to go in detail with their philosophy. Till then,\nI never thought that companies could have such high value engraved into them.\nMay be this was because, I was never brought up to look around that way. But\nnow, I can see their relevance in the society.",{"type":18,"tag":19,"props":77,"children":78},{},[79],{"type":23,"value":80},"But once I started reading about Apple and its design, I was immediately drawn\ninto it. Further, I could not help myself comparing the character to the\ncharacter of The Fountain Head. It might have been my fancy but surely it is\nhard to find such similarity between the fictional and real character.",{"type":18,"tag":19,"props":82,"children":83},{},[84],{"type":23,"value":85},"It has been now more than a year for my passion towards Apple products and I\ncan definitely say that I have great respect for the company. But nonetheless,\nI donot have any reason to criticize other companies. I find that in this eco-\nsystem everyone has their own role to play.",{"type":18,"tag":19,"props":87,"children":88},{},[89],{"type":23,"value":90},"Recently, I found a 1995 old interview of Steve Job. It was still the time\nwhen Steve was involved in NEXT and the first fully animated movie \"The Toy\nStory\" was still to be released. Steve talks about education, society and\nresponsibility of human. I will just share few interesting remarks from the\ninterview. If you have read Fountain Head you will understand that the\nresemblance of the philosophy of Apple or Steve is not a coincidence but a\nreal one.",{"type":18,"tag":19,"props":92,"children":93},{},[94,96,102],{"type":23,"value":95},"_",{"type":18,"tag":97,"props":98,"children":99},"strong",{},[100],{"type":23,"value":101},"SJ",{"type":23,"value":103}," : One of the things I feel is that, right now, if you ask who are the\ncustomers of education, the customers of education are the society at large,\nthe employers who hire people, things like that. But ultimately I think the\ncustomers are the parents. Not even the students but the parents. The problem\nthat we have in this country is that the customers went away. The customers\nstopped paying attention to their schools, for the most part. _",{"type":18,"tag":19,"props":105,"children":106},{},[107],{"type":18,"tag":108,"props":109,"children":110},"em",{},[111,116],{"type":18,"tag":97,"props":112,"children":113},{},[114],{"type":23,"value":115},"DM",{"type":23,"value":117}," : And the artistry is in the elegance of the solution, like chess\nplaying or mathematics?",{"type":18,"tag":19,"props":119,"children":120},{},[121,122,126],{"type":23,"value":95},{"type":18,"tag":97,"props":123,"children":124},{},[125],{"type":23,"value":101},{"type":23,"value":127}," : No. I think the artistry is in having an insight into what one sees\naround them. Generally putting things together in a way no one else has before\nand finding a way to express that to other people who don't have that insight\nso they can get some of the advantage of that insight that makes them feel a\ncertain way or allows them to do a certain thing. _",{"type":18,"tag":19,"props":129,"children":130},{},[131,132,136],{"type":23,"value":95},{"type":18,"tag":97,"props":133,"children":134},{},[135],{"type":23,"value":101},{"type":23,"value":137}," : I get asked this a lot and I have a pretty standard answer which is,\na lot of people come to me and say \"I want to be an entrepreneur\". And I go\n\"Oh that's great, what's your idea?\". And they say \"I don't have one yet\". And\nI say \"I think you should go get a job as a busboy or something until you find\nsomething you're really passionate about because it's a lot of work\". I'm\nconvinced that about half of what separates the successful entrepreneurs from\nthe non-successful ones is pure perseverance. It is so hard. _",{"type":18,"tag":19,"props":139,"children":140},{},[141],{"type":18,"tag":108,"props":142,"children":143},{},[144,148,150],{"type":18,"tag":97,"props":145,"children":146},{},[147],{"type":23,"value":101},{"type":23,"value":149}," : The market competition model seems to indicate that where there is a\nneed there is a lot of providers willing to tailor their products to fit that\nneed and a lot of competition which forces them to get better and better. I\nused to think when I was in my twenties that technology was the solution to\nmost of the world's problems, but unfortunately it just ain't so. I'll give\nyou an analogy. A lot of times we think \"Why is the television programming so\nbad? Why are television shows so demeaning, so poor?\" The first thought that\noccurs to you is \"Well, there is a conspiracy: the networks are feeding us\nthis slop because its cheap to produce. It's the networks that are controlling\nthis and they are feeding us this stuff but the truth of the matter, if you\nstudy it in any depth, is that networks absolutely ",{"type":18,"tag":97,"props":151,"children":152},{},[153],{"type":23,"value":154},"want to give people what\nthey want so that will watch the shows. If people wanted something different,\nthey would get it. And the truth of the matter is that the shows that are on\ntelevision, are on television because that's what people want. The majority of\npeople in this country want to turn on a television and turn off their brain\nand that's what they get. And that's far more depressing than a conspiracy.\nConspiracies are much more fun than the truth of the matter, which is that the\nvast majority of the public are pretty mindless most of the time. I think the\nschool situation has a parallel here when it comes to technology.",{"type":18,"tag":19,"props":156,"children":157},{},[158],{"type":18,"tag":108,"props":159,"children":160},{},[161,165],{"type":18,"tag":97,"props":162,"children":163},{},[164],{"type":23,"value":115},{"type":23,"value":166}," : You need passion to build a company like Apple or IBM or any other\nmajor company. Once you've taken the passion to that level and built a company\nand are in the position like a Bill Gates at Microsoft or anybody else,\nyourself, what are the responsibilities of those who have succeeded and have\neconomic power, social power? I mean, you've changed the world. What are your\nresponsibilities within that?",{"type":18,"tag":19,"props":168,"children":169},{},[170,171,175],{"type":23,"value":95},{"type":18,"tag":97,"props":172,"children":173},{},[174],{"type":23,"value":101},{"type":23,"value":176}," : That question can be taken on many levels. Obviously if you're\nrunning a company you have responsibilities but as an individual I don't think\nyou have responsibilities. I think the work speaks for itself. I don't think\nthat people have special responsibilities just because they've done something\nthat other people like or don't like. I think the work speaks for itself. _",{"type":18,"tag":19,"props":178,"children":179},{},[180,182,189],{"type":23,"value":181},"For full interview visit\n",{"type":18,"tag":30,"props":183,"children":186},{"href":184,"rel":185},"http://americanhistory.si.edu/collections/comphist/sj1.html",[34],[187],{"type":23,"value":188},"here",{"type":23,"value":190},".",{"type":18,"tag":19,"props":192,"children":193},{},[194],{"type":23,"value":195},"By the way, when I decided to write this, I wrote it because I found the\ncharacter in The Fountain Head and Steve Jobs very compellingly similar. So\nafter posting it when I searched for the similar subject, I found that I was\nnot only the one who thinks so..",{"title":7,"searchDepth":197,"depth":197,"links":198},2,[],"markdown","content:blog:the-fountain-head-and-steve-jobs.md","content","blog/the-fountain-head-and-steve-jobs.md","blog/the-fountain-head-and-steve-jobs","md",1719997688024]