[{"data":1,"prerenderedAt":82},["ShallowReactive",2],{"content-query-3Yz3OvxAOw":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":76,"_id":77,"_source":78,"_file":79,"_stem":80,"_extension":81},"/blog/ghost-of-an-idea","blog",false,"","Ghost of an Idea","tag:blogger.com,1999:blog-8061911113731935185.post-2539773974091806321","ghost-of-an-idea","2015-01-26T11:51:00.005-08:00","post",{"type":14,"children":15,"toc":73},"root",[16,32,38,43,48,53,58,63,68],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://4.bp.blogspot.com/-6qF_9xRz9GQ/VMadWZTT0xI/AAAAAAAABfA/fYmIfiPiz30/s1600/ghostofanidea.jpg",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":31},"img",{"alt":7,"src":24},[],{"type":17,"tag":18,"props":33,"children":34},{},[35],{"type":36,"value":37},"text","What nags you in the middle of the night? A nightmare or an idea. While\ngrowing up, I used to be awaken by nightmares and it still does.",{"type":17,"tag":18,"props":39,"children":40},{},[41],{"type":36,"value":42},"Few years back while I was visiting my home, I had to sleep in this old room.\nIt is located on the ground floor and has a dark passage towards it. The\nswitch to the lights are on the other side of the floor. My room use to be on\nthe top floor, now there isn’t any.",{"type":17,"tag":18,"props":44,"children":45},{},[46],{"type":36,"value":47},"I never liked the room, as growing up. It was always dark and cold. I still\nremember when I was a kid it use to be my parent's room. My dad would bring\nprojector from office and show slides on the wall. Photos from his recent\nEurope visits and that of his friends. I particularly remember one photo of a\nlady in her mid 30s wearing a red dress, she had very red lips. May be it was\nthen when it all started - the nightmares.",{"type":17,"tag":18,"props":49,"children":50},{},[51],{"type":36,"value":52},"Soon, my dad was transferred to eastern part of the country and we all had to\nmove along with him. The house was left empty for years and all the belongings\nwere stored in this room. Once in a while, during our city visit we use to\ncome to the house, clean it, have noodles at the near-by shop and spend a day.\nThe area was located far from the city and had a very few settlings. But now,\nits one of the booming part of the city.",{"type":17,"tag":18,"props":54,"children":55},{},[56],{"type":36,"value":57},"It was during one particular such visit, I remember entering the room. My\ngrand mom usually accompanied me, while I went through the old belongings and\ntoys. That night I had a high fever, my grand mom suspected a demon and she\npractised a small ritual trying to free the demon away. Since then, the event\nhas stayed with me.",{"type":17,"tag":18,"props":59,"children":60},{},[61],{"type":36,"value":62},"So few years back, when I had to spent a night at the room, I was a bit\napprehensive. Anyways, I didn’t take it too seriously. The room also use to be\noccupied by my close friend and his family, when they were living with us.\nDuring those times, I had spent many nights at the room. So there I was.",{"type":17,"tag":18,"props":64,"children":65},{},[66],{"type":36,"value":67},"That night, suddenly at the middle of it, I was awoken by a terrifying\nnightmare. It was one of those recurring dreams that I always have, since I\nwas a kid. For me there is one specific dream which has a recursive pattern of\nblack and white. After that I couldn't sleep the whole night.",{"type":17,"tag":18,"props":69,"children":70},{},[71],{"type":36,"value":72},"It was the ghost of an idea.",{"title":7,"searchDepth":74,"depth":74,"links":75},2,[],"markdown","content:blog:ghost-of-an-idea.md","content","blog/ghost-of-an-idea.md","blog/ghost-of-an-idea","md",1719053667305]