[{"data":1,"prerenderedAt":103},["ShallowReactive",2],{"content-query-gcZyxRPUvf":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":97,"_id":98,"_source":99,"_file":100,"_stem":101,"_extension":102},"/blog/great-expectation","blog",false,"","Great Expectation","tag:blogger.com,1999:blog-8061911113731935185.post-8063438810242517377","great-expectation","2008-09-15T03:13:00.000-07:00","post",{"type":14,"children":15,"toc":94},"root",[16,33,39,44,49,54,59,64,69,74,79,84,89],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://4.bp.blogspot.com/_UYUaEitRq54/SNfKsLHOVLI/AAAAAAAAAEI/vuOxl2GorRU/s1600-h/coat.jpg",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://4.bp.blogspot.com/_UYUaEitRq54/SNfKsLHOVLI/AAAAAAAAAEI/vuOxl2GorRU/s320/coat.jpg",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","\" Mirror O Mirror,",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"Look at me and tell my future.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"What is it that I have to be,",{"type":17,"tag":18,"props":50,"children":51},{},[52],{"type":37,"value":53},"or to be or not to be.\"",{"type":17,"tag":18,"props":55,"children":56},{},[57],{"type":37,"value":58},"Strangely, its this particular question that boggs me a lot. To be or not to\nbe. I don't know what it means nor do I know if it means any thing. Do I have\nto be something or nothing?",{"type":17,"tag":18,"props":60,"children":61},{},[62],{"type":37,"value":63},"Since everyone's childhood society keeps checking on your progress. They look\nat your each move and warns you of so called DANGER. They tell you what to do\nand what not to do. Do you know why? Because since the begining of the human\nrace, individualism has been nothing but a danger to the society. History\njustifies that. Know why? Donno myself but it seems its the nature of the\nsociety and nothing else.",{"type":17,"tag":18,"props":65,"children":66},{},[67],{"type":37,"value":68},"Society needs balance in their thoughts. It needs to feel secure of it-self\ncause human race needs to exist and survive the time. It needs to exist\nforever. Isn't that the whole reason for our growth? We need to exist. But\nwhat if one individual rises to question the whole existance? Well its a\nthreat to the human race. Cause that will make human race insecure, that is\nwhy society checks people to see that they don't digress from the rudimentry\nthought be it wrong or right.",{"type":17,"tag":18,"props":70,"children":71},{},[72],{"type":37,"value":73},"When you are young and just learning to walk the path and feeling free to\nthink on your own, society confuses your mind by asking you one very\nparticular question. \"So..., what do you want to be in your future?\" Looks\nlike a plain and mundane question. But No. Its this particular question that\nsuddenly breaks the freedom in your thought process and forces you to think\nabout your future. \"Hmm, what do I want to be?\"",{"type":17,"tag":18,"props":75,"children":76},{},[77],{"type":37,"value":78},"You start to look everywhere to see what is it that you want to be. Some are\nforced, some simply fall under the trap, some stay confused and some stay\nstrong and fearless. And it is this person who rejects the whole society's\nvalues and norms and become a threat. Do you want examples of it? I don't\nthink I have to give any, its so obvious. But thats not the end, in climax, he\nwins. But the victory comes at a price, a dreadful price and a painful one.\nBut finally society learns to think his way, the way which is suppose to be\nthe truth. But this too doesn't last, cause the new HE rises again. It can\nalso be SHE. So the process continues to infinity bringing unexpected changes\nin the society. But the challenge always remains.",{"type":17,"tag":18,"props":80,"children":81},{},[82],{"type":37,"value":83},"May be it is this challege that one has to face everytime. Some takes the\nchallenge while some submits itself to it. This challenge is the core cause of\nrevolution. The new begining but with a definite end.",{"type":17,"tag":18,"props":85,"children":86},{},[87],{"type":37,"value":88},"But am I wrong? Does every new thought has an end? Can we think of a way to\nbring this whole oscillation to an end? But will that bring anything? Think\nagain. May be it is THE CHALLENGE that is a trap. My whole reason is to make\neveryone think one their own and come to their own conclusion and not to\nfollow unlesss you yourself come to a similair conclusion.",{"type":17,"tag":18,"props":90,"children":91},{},[92],{"type":37,"value":93},"But one thing is sure, the society keeps expecting from each individual.\nEveryone is expected to do something, cause we all are one living organisms\nfighting to exist, be it a right way or a wrong way.",{"title":7,"searchDepth":95,"depth":95,"links":96},2,[],"markdown","content:blog:great-expectation.md","content","blog/great-expectation.md","blog/great-expectation","md",1719649311601]