[{"data":1,"prerenderedAt":165},["ShallowReactive",2],{"content-query-abD3lu3uYG":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":159,"_id":160,"_source":161,"_file":162,"_stem":163,"_extension":164},"/blog/friendship-a-perspective","blog",false,"","Friendship – a perspective","As I am writing this, I am staying at home simply bored and silent. Only two\ndays left before I depart to Bangalore, I am restless and bored. I look\nmultiple times at my phone book, and simply see no one call, or even if I do I\nsimply decide not to – as I see no point in it. This is when I have this\nconflicting idea about friendship and what it means to me.","tag:blogger.com,1999:blog-8061911113731935185.post-5408459489225356994","friendship-a-perspective","2012-03-26T11:44:00.000-07:00","post",{"type":15,"children":16,"toc":156},"root",[17,24,39,44,49,54,65,75,85,95,105,115,127,132,137,142,147],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27],{"type":18,"tag":28,"props":29,"children":33},"a",{"href":30,"rel":31},"http://2.bp.blogspot.com/-d59DxeQ31cw/T3C4qato84I/AAAAAAAABAY/aNoPZBuzURk/s1600/IMG_3293.JPG",[32],"nofollow",[34],{"type":18,"tag":35,"props":36,"children":38},"img",{"alt":7,"src":37},"http://2.bp.blogspot.com/-d59DxeQ31cw/T3C4qato84I/AAAAAAAABAY/aNoPZBuzURk/s320/IMG_3293.JPG",[],{"type":18,"tag":19,"props":40,"children":41},{},[42],{"type":23,"value":43},"In your life, you come across many people and you spend your certain time with\nthem, which allows you to decide if you would want to continue your\nacquaintance or not. As you move on, you make different kinds of friends –\ngood friends, bad friends, boring friends, interesting friends and so on.  But\nas I returned to KTM this time, I was filled with mixed feelings as I was not\nable to comprehend this relationship of friendship, which was uncomfortably\npinching me.",{"type":18,"tag":19,"props":45,"children":46},{},[47],{"type":23,"value":48},"The reason I was simply bored to death to call up anyone was because I felt\nthis urge of responsibility to explain myself to them and justify my actions.\nAs if to say that I was burden with a task to explain myself to the society\nand wait for their verdict. And if anyone knows too well enough, I hate\nlistening to any such verdict as I don’t consider anyone worthy enough to\njudge me(and I think this is how everyone should be living).",{"type":18,"tag":19,"props":50,"children":51},{},[52],{"type":23,"value":53},"This is when I started categorizing friends in my mind and put them into the\nlist of priorities. This is what I came off with.",{"type":18,"tag":19,"props":55,"children":56},{},[57,63],{"type":18,"tag":58,"props":59,"children":60},"strong",{},[61],{"type":23,"value":62},"Cat 1:",{"type":23,"value":64}," These are friends I know and have been acquainted at some time. I\nmight have had good experience with them or bad. But I see no point or even\nslightest urge to even think about them. But I know that some time in my life,\nI will come across them and even then it would not matter at all.",{"type":18,"tag":19,"props":66,"children":67},{},[68,73],{"type":18,"tag":58,"props":69,"children":70},{},[71],{"type":23,"value":72},"Cat 2:",{"type":23,"value":74}," These are friends that have been good to me and we have had good\ntimes together. But now as we have moved along, things have changed and so has\nour perspective. Hence there is this uncomfortable sense of discomfort in\ntrying to explain ourselves to each other. This leaves me with no option but\nto simply ignore.",{"type":18,"tag":19,"props":76,"children":77},{},[78,83],{"type":18,"tag":58,"props":79,"children":80},{},[81],{"type":23,"value":82},"Cat 3:",{"type":23,"value":84}," These are new acquaintances and new faces in my life. They have no\nsense of expectation from me; neither do I have any from them. We are bound by\nour circumstances and there is no way we can ignore each other. Hence they are\nmy NOW, stumbling ahead learning each day new thing about ourselves. This is\nmy belief that with every new people you meet, you learn something new about\nyourself.",{"type":18,"tag":19,"props":86,"children":87},{},[88,93],{"type":18,"tag":58,"props":89,"children":90},{},[91],{"type":23,"value":92},"Cat 4:",{"type":23,"value":94}," These are the to-be your new acquaintances. Somehow, I put them in\nmy reserve as I am in no hurry to meet anyone new.  This process of making new\nfriends and being in a phase of unknown land is sometime frustration.",{"type":18,"tag":19,"props":96,"children":97},{},[98,103],{"type":18,"tag":58,"props":99,"children":100},{},[101],{"type":23,"value":102},"Cat 5:",{"type":23,"value":104}," People you wish you would meet. These come between the relationship\nof friends and siblings. It’s really interesting, because they are not your\nfriends as per say with whom you share everything, but they have a different\nkind of close relationship which sounds almost like your brother and sister.\nThese are the friends who will remain forever with you because there is no way\nyou can have any kind of misunderstanding with them, nor any fight. They\nsimply are there with whom you can share some ideas and some old times.",{"type":18,"tag":19,"props":106,"children":107},{},[108,113],{"type":18,"tag":58,"props":109,"children":110},{},[111],{"type":23,"value":112},"Cat 6:",{"type":23,"value":114}," Finally I come to my special category of friends. My best friends\nwhom I would wish to be there till the end of me. One of the most important\nthings about being with your best friends is that you can be as honest as you\ncan be. You don’t have to justify to them neither wait for any approval from\nthem. They have complete faith in you and you have in them. You can call them\nany time for a coffee and they will not ask why and where. They simply know it\nand when you meet, there is no social pressure to speak or communicate. You\ncan be yourself, be silent, sip a coffee, look out to the world and say bye.\nIsn’t that what your best friends would be like, whose presence just makes you\nfeel comfortable?",{"type":18,"tag":19,"props":116,"children":117},{},[118],{"type":18,"tag":28,"props":119,"children":122},{"href":120,"rel":121},"http://4.bp.blogspot.com/-55lwIJgvr_g/T3C4y7JhyuI/AAAAAAAABAg/_2G6ZCIYXFA/s1600/IMG_3156.JPG",[32],[123],{"type":18,"tag":35,"props":124,"children":126},{"alt":7,"src":125},"http://4.bp.blogspot.com/-55lwIJgvr_g/T3C4y7JhyuI/AAAAAAAABAg/_2G6ZCIYXFA/s320/IMG_3156.JPG",[],{"type":18,"tag":19,"props":128,"children":129},{},[130],{"type":23,"value":131},"As I was writing this, I had to break in between and accompany my dad to visit\none of my old grand-dad whom he usually takes me to whenever I return home. He\nsays that the grand-dad had helped him during his early struggling times. It\nwas only when we reached his home that he mentioned about the death of the\ngrand-mom whom I never saw, or if I ever did I would not remember well.",{"type":18,"tag":19,"props":133,"children":134},{},[135],{"type":23,"value":136},"Anyway, when I met the grand-dad, he had traditional local nepali newspaper in\nhis one hand and a large magnifying glass in other hand. He was peering with\nhis weak eyes into the latest political gup-sup. I think this is one of the\nmost common traits of an old Nepalese man, who are continuously aware of every\npolitical ups and downs.",{"type":18,"tag":19,"props":138,"children":139},{},[140],{"type":23,"value":141},"There was a sense of satisfaction in his eyes, when he saw my dad. I was on\nthe other hand just an observer. There was a long silence and then the grand\ndad started to recall the last moments with grand mom and how he still feels\nthat she is some-where up-stairs. As we grow older, we gather much more wisdom\nand begin to understand life better. At the middle of all this conversation,\nhe mentioned something which really touched me. He said something like this,\n“I am glad she is gone because if I had gone before her she would have to face\na lot of trouble. Now I can leave without any worry.”  These words just\nremained with me as I was returning home.",{"type":18,"tag":19,"props":143,"children":144},{},[145],{"type":23,"value":146},"I think in this whole perspective of life, you would really feel pain of\nleaving early and leaving your friends behind. But the other ways also would\nbe a lonely road.",{"type":18,"tag":19,"props":148,"children":149},{},[150],{"type":18,"tag":151,"props":152,"children":153},"span",{},[154],{"type":23,"value":155},"Image : Took them @ Rampur Chitwan",{"title":7,"searchDepth":157,"depth":157,"links":158},2,[],"markdown","content:blog:friendship-a-perspective.md","content","blog/friendship-a-perspective.md","blog/friendship-a-perspective","md",1719977874308]