[{"data":1,"prerenderedAt":94},["ShallowReactive",2],{"content-query-qpeIB7Ierm":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":88,"_id":89,"_source":90,"_file":91,"_stem":92,"_extension":93},"/blog/being-an-artist-and-being-an-entrepreneur-is-almost-similar","blog",false,"","Being an Artist and Being an Entrepreneur is almost similar","Most people flock to big cities to pursue their dreams and struggle for years.\nSome people succeed but many still find themselves waiting for the\nopportunities. They consider that opportunity is the biggest thing that can\nactually leverage their talent or skill. But I believe that it is not always\nso.","tag:blogger.com,1999:blog-8061911113731935185.post-6492323366767600992","being-an-artist-and-being-an-entrepreneur-is-almost-similar","2011-05-21T03:03:00.000-07:00","post",{"type":15,"children":16,"toc":84},"root",[17,24,29,34,39,54,69,74,79],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27],{"type":23,"value":28},"There are couple of examples that proves that opportunity along is not\neverything. Moreover in today’s media hyped world, opportunities are\neverywhere from a reality TV shows to your own youtube channel, twitter\naccount or facebook profile.",{"type":18,"tag":19,"props":30,"children":31},{},[32],{"type":23,"value":33},"If you look around in youtube, there are lots of artists doing great with\ntheir skills and scaling them to offline. This gives a lot of encouragement to\nall those people who want to pursue their passion. But there is a reality\nbeyond pursuing your dreams that everyone considers once in a while. It’s how\nfar you can take yourself with what you have. Most people get stuck on it and\nlose their passion in mid way, and some people simply cannot go beyond what\nthey already have.",{"type":18,"tag":19,"props":35,"children":36},{},[37],{"type":23,"value":38},"Take examples of hundreds of reality shows winners and contestants who were\ngiven the lime light exposure through grandiose celebration. Most are not even\nthere in the industry and some have wandered away, and some have simply\ndisappeared. I am not really the greatest fans of reality shows but they have\ntheir pros and cons. But at the end, all those participants for whatever\nreasons they competed starts to make no sense. Along the path of life, all the\nopportunity and exposure goes into nothing. I think, they become unable to\npush themselves, or they realise that it’s not only about opportunity or\nexposure, it’s about honestly and perseverance. And it takes hell lot of time\nto become what you really wanted to be.",{"type":18,"tag":40,"props":41,"children":42},"h2",{"id":7},[43],{"type":18,"tag":44,"props":45,"children":49},"a",{"href":46,"rel":47},"http://www.starway.org/Titanic/pictures/Titanic%20BW.gif",[48],"nofollow",[50],{"type":18,"tag":51,"props":52,"children":53},"img",{"alt":7,"src":46},[],{"type":18,"tag":19,"props":55,"children":56},{},[57,63,67],{"type":18,"tag":58,"props":59,"children":60},"em",{},[61],{"type":23,"value":62},"Source : starway.org/Titanic/",{"type":18,"tag":64,"props":65,"children":66},"br",{},[],{"type":23,"value":68},"\nSo I have been wondering what it takes to make that jumps which takes you to\nthe next level. Entrepreneurs also fall into similar category. They start with\nsome idea and work very hard to seek opportunity and exposure. Along the way,\nthey fail and some move along, some take another chance and some just\ndisappears. It takes a lot to work on your ideas and to shape them into the\nexisting industry. It doesn’t matter, if you are trying to create a new\nindustry or market, or be part of an industry, the work is equally\nchallenging.",{"type":18,"tag":19,"props":70,"children":71},{},[72],{"type":23,"value":73},"Most entrepreneurs, similar to an artist cannot push themselves out of where\nthey already are and get hindered by their own limitation. If we look into\ngreat artists, you will notice that they always make a jump to something\ndifferent and take risk to fail. To explore ones horizon is very important for\nartists, because they are always in constant pressure to create something\ndifferent. No artist has become successful by just making one masterpiece.\nIt’s the continuum of those master pieces and variety which takes them to\ntheir status. This is true even for entrepreneurs; great entrepreneurs are\nalways pushing the envelope and innovating to reach that extreme end. Some\nfail, but its always worth taking a risk.",{"type":18,"tag":19,"props":75,"children":76},{},[77],{"type":23,"value":78},"So my final note is that, to be what you want to be, you have to scale up and\nsee the bigger picture and keep struggling. Coz the goal is not always to\nreach where you want to, but to make sure that every day is a worthwhile to\nlive for. Even after more than 2 years of my experience in entrepreneurship, I\nmay not have reached where I want to and I may have failed in many ways, but\nevery day was worth living for and making sure that it continues that way is I\nthink the biggest challenge.Most people query me, why entrepreneurship, I mean\nyou are a graduated engineer? And honestly, for me I see no difference between\nengineers and entrepreneurs, for me both stands for someone trying very hard\nto create something and innovate everyday.",{"type":18,"tag":19,"props":80,"children":81},{},[82],{"type":23,"value":83},"No great movie director rests on their previous movie; he/she is continually\nworking on the next great things. No great musician stop making music coz they\nthink they have had it, they explore till they die. No great writers stop\nwriting coz they think they have succeeded. No scientist stop thinking, they\nare continually jumping from one problem to other. And no creative\nentrepreneurs stop experimenting with ideas, they keep exploring till they\ncan. Not to settle is hard and a choice has to be made. It’s always up to us\nto decide if we want to reach the dream.",{"title":7,"searchDepth":85,"depth":85,"links":86},2,[87],{"id":7,"depth":85,"text":7},"markdown","content:blog:being-an-artist-and-being-an-entrepreneur-is-almost-similar.md","content","blog/being-an-artist-and-being-an-entrepreneur-is-almost-similar.md","blog/being-an-artist-and-being-an-entrepreneur-is-almost-similar","md",1719649311068]