[{"data":1,"prerenderedAt":96},["ShallowReactive",2],{"content-query-doP58HdwoQ":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":90,"_id":91,"_source":92,"_file":93,"_stem":94,"_extension":95},"/blog/the-difference","blog",false,"","The Difference","[![](http://3.bp.blogspot.com/_UYUaEitRq54/SPjKfAL8gKI/AAAAAAAAAI0/4H8p2oVn-\nfM/s400/difference.jpg)](http://3.bp.blogspot.com/_UYUaEitRq54/SPjKfAL8gKI/AAAAAAAAAI0/4H8p2oVn-\nfM/s1600-h/difference.jpg)","tag:blogger.com,1999:blog-8061911113731935185.post-6820891355957400292","the-difference","2008-10-17T08:58:00.000-07:00","post",{"type":15,"children":16,"toc":87},"root",[17,42,47,52,57,62,67,72,77,82],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22,25,33,35,40],{"type":23,"value":24},"text","[![](",{"type":18,"tag":26,"props":27,"children":31},"a",{"href":28,"rel":29},"http://3.bp.blogspot.com/_UYUaEitRq54/SPjKfAL8gKI/AAAAAAAAAI0/4H8p2oVn-",[30],"nofollow",[32],{"type":23,"value":28},{"type":23,"value":34},"\nfM/s400/difference.jpg)](",{"type":18,"tag":26,"props":36,"children":38},{"href":28,"rel":37},[30],[39],{"type":23,"value":28},{"type":23,"value":41},"\nfM/s1600-h/difference.jpg)",{"type":18,"tag":19,"props":43,"children":44},{},[45],{"type":23,"value":46},"What kind of difference am I talking about? Well, one very important\ndifference between the under developed and the developed country. I came\nacross this difference long time back during my student years, but found it\nvery interesting when it was talked about in one of the debate, in BBC radio.\nThe difference lies in perspective of the science student, in the developing\ncountry and the developed country.",{"type":18,"tag":19,"props":48,"children":49},{},[50],{"type":23,"value":51},"The program in the BBC radio had very interesting point to make. They had two\nteams of science student- one from UK and the other from some Asian country.\nBoth of them were asked why they chose to study science. Remarkably the views\nwere very very different. And off-course it had lot to do with the economic\nconditions of the country.",{"type":18,"tag":19,"props":53,"children":54},{},[55],{"type":23,"value":56},"The students from under developed country told that, they hope to bring the\nchanges in the country, by pursuing science. Some wanted to be engineers, some\ndoctors and some wanted to go to medicine. In one view, it seems very likely\nthat they would think that opting science would really help their country to\ngrow.",{"type":18,"tag":19,"props":58,"children":59},{},[60],{"type":23,"value":61},"On the other hand, the student from the developed country had never thought of\nit that way. They were studying science merely because they were interested in\nthe subject.",{"type":18,"tag":19,"props":63,"children":64},{},[65],{"type":23,"value":66},"Now here is the big difference, isn't it? So this is how young minds of\ndifferent continents think. So.....seriously, does taking a science subject\nhelp you to over come the difficulties of your country. I really want to get\nto the bottom this is discussion.",{"type":18,"tag":19,"props":68,"children":69},{},[70],{"type":23,"value":71},"Some of my observations goes in this way. Many science student in under\ndeveloped country, do their further studies in foreign country and very rarely\ndo we find them returning to their home land. Hmmm. Development! Where did\nthat go? But it doesn't happen this way always and I am not blaming anyone.",{"type":18,"tag":19,"props":73,"children":74},{},[75],{"type":23,"value":76},"The main problem lies when young mind start getting deeper into their studies.\nAs they go further, they find themselves entangled in the mystery of their\nfield. They go further into the field rather than their vision. In other\nwords, they get overwhelmed by the depth of knowledge. So knowing becomes more\nimportant than applying the known knowledge. Nothing wrong with going deeper\nwith knowledge, just know when to act when you have it all.",{"type":18,"tag":19,"props":78,"children":79},{},[80],{"type":23,"value":81},"Therefore, its not the field that you choose that is going to help you help\nthe country. Instead, its your vision that is going to help. What do you\nreally want to do with your knowledge, is more important than what you want to\nstudy. Being practical with your knowledge is what I was trying to tell so\nfar.",{"type":18,"tag":19,"props":83,"children":84},{},[85],{"type":23,"value":86},"So this difference between the beliefs has really something to tell us about\nthe way we decide what we want to study and why. So if you really want to help\ntry being practical.",{"title":7,"searchDepth":88,"depth":88,"links":89},2,[],"markdown","content:blog:the-difference.md","content","blog/the-difference.md","blog/the-difference","md",1719053668228]