[{"data":1,"prerenderedAt":147},["ShallowReactive",2],{"content-query-lPVtWAinE9":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":141,"_id":142,"_source":143,"_file":144,"_stem":145,"_extension":146},"/blog/waiting-for-the-right-bus","blog",false,"","Waiting for the right bus","[![](http://lh3.googleusercontent.com/-7GLQ7zjnq7I/VYxuPTOqm2I/AAAAAAAABh8/gg_5K8iWldk/s640/blogger-\nimage-1235241482.jpg)](https://lh3.googleusercontent.com/-7GLQ7zjnq7I/VYxuPTOqm2I/AAAAAAAABh8/gg_5K8iWldk/s640/blogger-\nimage-1235241482.jpg)","tag:blogger.com,1999:blog-8061911113731935185.post-1272774579810928316","waiting-for-the-right-bus","2015-06-25T21:26:00.001-07:00","post",{"type":15,"children":16,"toc":138},"root",[17,43,48,53,58,63,68,73,78,83,88,93,98,103,108,113,118,123,128,133],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22,25,33,35,41],{"type":23,"value":24},"text","[![](",{"type":18,"tag":26,"props":27,"children":31},"a",{"href":28,"rel":29},"http://lh3.googleusercontent.com/-7GLQ7zjnq7I/VYxuPTOqm2I/AAAAAAAABh8/gg_5K8iWldk/s640/blogger-",[30],"nofollow",[32],{"type":23,"value":28},{"type":23,"value":34},"\nimage-1235241482.jpg)](",{"type":18,"tag":26,"props":36,"children":39},{"href":37,"rel":38},"https://lh3.googleusercontent.com/-7GLQ7zjnq7I/VYxuPTOqm2I/AAAAAAAABh8/gg_5K8iWldk/s640/blogger-",[30],[40],{"type":23,"value":37},{"type":23,"value":42},"\nimage-1235241482.jpg)",{"type":18,"tag":19,"props":44,"children":45},{},[46],{"type":23,"value":47},"Everyday, after college I would walk home with my friends. Wandering around\nand talking about future. What will we do? How will we be? How much will we\nchange? Ideas! Ambitions! Life!!!",{"type":18,"tag":19,"props":49,"children":50},{},[51],{"type":23,"value":52},"Everything always tumbled down to a cup of tea at a near by shop, where we\nwere regular visitors. A sip of tea and bunch of thought provoking questions\nand contradictions. All intelligent and weird minds searching for the answer\nto a common question - the meaning of life. Trying to find that right path\ntowards salvation. Complete Consciousness!!",{"type":18,"tag":19,"props":54,"children":55},{},[56],{"type":23,"value":57},"Now and then we would simply get lost within ourselves, in the midst of the\ncrowd. Thoughts wandering far beyond the time frame. Everyone building their\nlife on their own dimensions. Confident. Lost. But hopeful.",{"type":18,"tag":19,"props":59,"children":60},{},[61],{"type":23,"value":62},"Like some lost sailors on a boat, every one of us would be looking at\ndifferent directions hoping to see some signs of calling. But then we wouldn't\nfind any. \"What are we searching for ?\", would be one damning question in\nevery one's mind. But the pattern would repeat itself and we would find\nourselves in a never ending  loop, looking at different directions with our\nbacks facing each other.",{"type":18,"tag":19,"props":64,"children":65},{},[66],{"type":23,"value":67},"It was an isolated space we had created for ourselves, safe from the outer\nworlds. I think that is what friendship does, isn't it? It creates a space\nwithin this chaos of life, where we find ourselves secure and submerged to\nown-self. A space untouched by the judgments and its overpowering\nexpectations. But for how long?",{"type":18,"tag":19,"props":69,"children":70},{},[71],{"type":23,"value":72},"With the stretch of time, the space would soon collapse into the fabric of\nsocial norms exposing each of our vulnerabilities and weaknesses. A bubble of\ncocoon waiting to burst dropping us into the ocean ruled by sharks. And here\nin the arena of death, we all would find our own harbor. A war of life!",{"type":18,"tag":19,"props":74,"children":75},{},[76],{"type":23,"value":77},"All these thoughts would connect us telepathically when we are not together,\ncreating a surreal experience of becoming invisible in the crowd. But again,\nfor how long?",{"type":18,"tag":19,"props":79,"children":80},{},[81],{"type":23,"value":82},"At times, I would find myself disconnected and standing alone, facing the\nwilderness of the world. Alone, but among crowds, waiting for the right bus to\ncome and take me home.",{"type":18,"tag":19,"props":84,"children":85},{},[86],{"type":23,"value":87},"These rides would be just as experiential as a conversation with the\nphilosophers of the world. Dangling with people, popping out of all the open\nspaces, bus would come screeching at you. As people struggled and jostled\ntowards the opening of the portal, I would distant myself to observe and wait\nfor the bus with the right number. Is it even coming?",{"type":18,"tag":19,"props":89,"children":90},{},[91],{"type":23,"value":92},"Like a trained sales person conductors would scare you that its the last bus\ntonight, no more is coming for you. But the experience has already told me to\nignore them in disbelieve. He is totally lying, I would say to myself. How is\nit even possible? There has to be the bus with the right number coming for me.\nIts only 8 PM. I would then wait in the darkness.",{"type":18,"tag":19,"props":94,"children":95},{},[96],{"type":23,"value":97},"Time can be cruel, specially as the darkness begins and struggles for its own\nexistence. Often I would wonder, should I have just rode on that last bus, no\nmatter what? It would have at least taken me somewhere - safe and sound.",{"type":18,"tag":19,"props":99,"children":100},{},[101],{"type":23,"value":102},"Then, I didn't realize much, but when I think about it now. May be I was\nwaiting for one of those Hayao Miyazaki's magical cat from \"My Neighbor\nTotoro\" to come and pick me up, take me to the world of dreams. Ya exactly the\nsame way.",{"type":18,"tag":19,"props":104,"children":105},{},[106],{"type":23,"value":107},"But I would always end up riding a bit early in one of those dangling bus,\ndefeated by the wait - not really the friendly Totoro which I expected. Among\nthe midst of human slaves, I would find myself indifferent. Its one of the\ncontradiction of a society, which I find amusing. Some how we can always\ncocoon ourselves within our own existence. People generally blame technology\nfor this indifference but its there, inherent within ourselves. Over time, the\ntechnology has only replaced the anchor of safety, but the anchor has always\nexisted. The anchor that holds our emotions safe within the confine parameter\nof control. If that anchor is loosened I am not sure what kind of emotional\ncalamity the world will have to face.",{"type":18,"tag":19,"props":109,"children":110},{},[111],{"type":23,"value":112},"Faces filled with experience and sorrow. I have never seen a face that carries\nthe experience of happiness, its always that long scar of sorrow that we all\ncarry. Even behind a smiling face, lies some untold stories. The ways we carry\nour sorrows are different than the ways we carry our happiness. Happiness is\nlike a shooting star, it comes and goes within seconds. Sometime you even\ndoubt yourself, if it even existed. But sorrows are like billions and\ntrillions of stars just staring at you every night, watching you and making\nyou watch them in return. You will never be able to run away from them.",{"type":18,"tag":19,"props":114,"children":115},{},[116],{"type":23,"value":117},"I am never sure what we wait for the most - for the sun to rise, or for it to\nset. Thoughtful contemplation!",{"type":18,"tag":19,"props":119,"children":120},{},[121],{"type":23,"value":122},"And sometime I would just wait and wait. But there would be no bus to take me\nhome. Like a soldier who had lost a battle, I would walk all the way back to\nhome. I am not sure till today, if I wanted to get to home or somewhere else.\nBut every night I would always end up in my room with a bag full of unanswered\nquestions.",{"type":18,"tag":19,"props":124,"children":125},{},[126],{"type":23,"value":127},"The fallacy of dream is that its unreal and based upon memories created\nthrough your weak senses. Its a place where the questions of the day would\nfinally find itself slowly unraveled but wrapped into a mystic symbolism.\nConflicts, fear and all your desires painted into a canvas like some abstract\nart.",{"type":18,"tag":19,"props":129,"children":130},{},[131],{"type":23,"value":132},"Neither you nor the painter can understand the meaning behind it. All your\nyears of experiences is distilled into this one night's dream. And this\nabstract form of art is nothing but stacks of paintings layered one upon the\nother. Upon close observations you can notice fine brush strokes from your\npast, still clear and sharp. And just when you feel like you have understood,\nyou are awaken from the dream with a fresh canvas of memory waiting to be\nfilled by the day.",{"type":18,"tag":19,"props":134,"children":135},{},[136],{"type":23,"value":137},"But what if at that moment of wait, you would not walk to your home and keep\nwaiting. Even if the streets are cold and empty with an unbroken vow of\nsilence, what if you didn't move an inch. Killing your every instinct to hide\nin your burrow, what if you stood there motionless like there was nothing to\nfear. What if all you had was your conviction that the right bus would come.\nAnd even if it didn't turn up at the dawn, would you still have guts to wait\nfor it every other night?",{"title":7,"searchDepth":139,"depth":139,"links":140},2,[],"markdown","content:blog:waiting-for-the-right-bus.md","content","blog/waiting-for-the-right-bus.md","blog/waiting-for-the-right-bus","md",1719050485700]