[{"data":1,"prerenderedAt":93},["ShallowReactive",2],{"content-query-PCec6i8eMI":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":87,"_id":88,"_source":89,"_file":90,"_stem":91,"_extension":92},"/blog/concept-of-healthy-community-design","blog",false,"","Concept of Healthy Community Design","I have always indulged myself observing people move through their life and\nmake a living for them. The strange dependence that human beings have with\neach other is interesting to observe. But in this strange society, we all are\nbound by moral values, laws and expectations. I can never completely\nunderstand this mere presence of poverty that stares and the meaning of it. If\nit even means anything to be poor in a society and make your way through\nstruggle, or born rich and stumble through pitfalls of social disaster. The\nexamples of such scenarios are abundant in our society.","tag:blogger.com,1999:blog-8061911113731935185.post-6203449712501779466","concept-of-healthy-community-design","2011-07-17T13:20:00.000-07:00","post",{"type":15,"children":16,"toc":83},"root",[17,22,28,43,48,53,58,63,68,73,78],{"type":18,"tag":19,"props":20,"children":21},"element","hr",{},[],{"type":18,"tag":23,"props":24,"children":25},"p",{},[26],{"type":27,"value":9},"text",{"type":18,"tag":29,"props":30,"children":31},"h2",{"id":7},[32],{"type":18,"tag":33,"props":34,"children":38},"a",{"href":35,"rel":36},"http://sscl.files.wordpress.com/2010/06/groupfacilitation.jpg",[37],"nofollow",[39],{"type":18,"tag":40,"props":41,"children":42},"img",{"alt":7,"src":35},[],{"type":18,"tag":23,"props":44,"children":45},{},[46],{"type":27,"value":47},"Source : sscl.wordpress.com",{"type":18,"tag":23,"props":49,"children":50},{},[51],{"type":27,"value":52},"I consider myself very lucky to have spent my childhoods in between urban and\nrural areas. I was exposed to city life and rural lifestyle parallel. This has\nmade my experience rich in those terms. More importantly, I could very much\nsay that the society that I was living in was an experimental one. It was the\nconvergence and harmony between village and urban technology, living hand in\nhand. I lived in the midst of Agricultural Research Centre which had at that\ntime, the most advance technology for research and science purpose.  This was\nduring 90s. Later in my life, I was told that the whole project was evolved to\nhelp the community make their living sustainable.",{"type":18,"tag":23,"props":54,"children":55},{},[56],{"type":27,"value":57},"You can imagine that this had tremendous impact on how I wanted to live my\nlife in future - in the midst of research and technology, helping society\nfigure out a way to be efficient. Interestingly, though it was 90s, I happen\nto touch and feel laptop before PCs. My father would bring this foldable DOS\nOS laptop and I would watch him type in WordStar. The first command that I\never learned was the BACKSPACE key, which my father would repetitively use. At\none instance, I was so eagerly watching him type that, I hurriedly pressed the\nkey before he did, which amused him a lot and made him run to my mother to\nexplain the drama. (Similar incident happened once I took a scissor and hold a\ncotton to clean my wounds. It was something taught in our first-aid class and\nit amused him more, thinking I would opt for studying Medicine in future. But\nBACKSPACE key was more interesting than a scissor and cotton. ) These days, he\noften consults with me his problems on outlook mail and excels sheets. J\nThese things make life very interesting.",{"type":18,"tag":23,"props":59,"children":60},{},[61],{"type":27,"value":62},"Anyway coming back to my main point, I would sometime visit research labs full\nof PCs and get lost observing the FISH theme screen saver. It was the most\ninspiring and interesting time, which would remain with me forever. The house\nI lived in was simple and well equipped with furniture and resource supply, I\nnever thought there was anything more that I would need in my life. The place\nwas beautiful with changing climate, which made it all interesting. There were\ntimes, when the sky would be filled with brown flies and frogs all set to feed\non them. We also had 7 important channels, delivered to our house through DISH\nantennae.  All I wanted was to work like my father and contribute to make this\nsociety efficient in terms of economy and culture.  Ohh!! How I miss those\ndays and simplicity. But I guess, I had to move on to explore the horizon. So\namong my many friends I was the first one to live the place and move to city\nfor my further degree. Since then, I have never found existence of any\ncommunity as vibrant and efficient.",{"type":18,"tag":23,"props":64,"children":65},{},[66],{"type":27,"value":67},"This is what brings to me the main topic - Struggle to build an efficient and\ngrowing community. Its bliss these days to even find any, though there\nexistence is rare. After almost 3 years of start-up experience and struggle, I\ncan see why it’s so difficult to have such systems. There are so many\nvariables and difficulties in establishing a profitable business of value with\nefficiency. I guess more time is spent in experimenting and learning what\nworks and what doesn’t and you need to change as it comes around. I find the\nmanagement of resources and involving them into goal-oriented project, the\nmain challenge. You have to look at the value your company is presenting to\nthe business and how you are doing it. You need to communicate with potential\npartners to create better opportunity and scalable business. During all this,\nyou need to clearly know the distracting factors too, because that is\nimportant for growth and sustainability and those factors have potential to\nmake it or break your company. Similarly with the community, there are many\nfactors which encourage the members of the community to participate and move\nalone, but negligence to counter the distracting factor could heavily falter\nthe growth and demise of the community. I think that is what happened to the\nplace that I lived during my childhood, though the place exists, I hear it’s\nnot as interesting and vibrant as before.",{"type":18,"tag":23,"props":69,"children":70},{},[71],{"type":27,"value":72},"So the final thought, how can we build a sustainable community? Can they be\ndesigned? If so how? Here are few thoughts of mine. First of all, the\nlandscape of the community is very important because that is going to define a\nlot of things like economy, culture and population. The space where people\nlive is very important, as they affect the emotions of people. I believe that\nspace can affect human’s senses in lot many ways then we can imagine. Along\nwith landscape comes the important role of resources and there management. A\ncommunity is a combination of people with variety of skills and interest,\nwhich can be channelized for betterment of the society. Any rejection of such\nhuman resource could result into migration. Then comes the efficient economy\nof the society and how they can be managed without much lose. The continuous\nflow of financial transaction between people is one of the parameters to\nconsider the health of the society. Off course the culture is important which\nbinds people together with the feeling of oneness and one. Absence of culture\ncould result in frustration and dissociation of the community because\ncommunity is the higher realization of individual which is as important as\nindividual.",{"type":18,"tag":23,"props":74,"children":75},{},[76],{"type":27,"value":77},"The last statement could be controversial as it raises the debate between\nindividualism and communal behaviour, but there is some practical implication\nwhere both fail to answer deep rooted question of life and society. Being\nopen-minded can only be the way to resolve this issue rather than following\nsome hardcore philosophies.",{"type":18,"tag":23,"props":79,"children":80},{},[81],{"type":27,"value":82},"As you can see, the question of community design is important in today’s\nsociety. It can come in a form of an organisation design or community design.\nI believe both follow similar line of thought.",{"title":7,"searchDepth":84,"depth":84,"links":85},2,[86],{"id":7,"depth":84,"text":7},"markdown","content:blog:concept-of-healthy-community-design.md","content","blog/concept-of-healthy-community-design.md","blog/concept-of-healthy-community-design","md",1719047577736]