[{"data":1,"prerenderedAt":158},["ShallowReactive",2],{"content-query-N70dwat9Y6":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":152,"_id":153,"_source":154,"_file":155,"_stem":156,"_extension":157},"/blog/personal-projects","blog",false,"","Personal Projects","[![](http://www.khulsey.com/masters/dk_star-trek_starship-uss-\nenterprise.jpeg)](http://www.khulsey.com/masters/dk_star-trek_starship-uss-\nenterprise.jpeg)","tag:blogger.com,1999:blog-8061911113731935185.post-4174427719059969776","personal-projects","2011-09-18T11:43:00.000-07:00","post",{"type":15,"children":16,"toc":148},"root",[17,42,47,52,57,62,73,78,83,88,102,107,112,117,122],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22,25,33,35,40],{"type":23,"value":24},"text","[![](",{"type":18,"tag":26,"props":27,"children":31},"a",{"href":28,"rel":29},"http://www.khulsey.com/masters/dk_star-trek_starship-uss-",[30],"nofollow",[32],{"type":23,"value":28},{"type":23,"value":34},"\nenterprise.jpeg)](",{"type":18,"tag":26,"props":36,"children":38},{"href":28,"rel":37},[30],[39],{"type":23,"value":28},{"type":23,"value":41},"\nenterprise.jpeg)",{"type":18,"tag":19,"props":43,"children":44},{},[45],{"type":23,"value":46},"As far as remember, I have been doing personal projects since I was a kid.\nFrom a simple stamp collection hobby to attempting to build a flying glider,\nmy life has become an instances of projects, one after the other. The whole\nconcept of giving form to a formless thoughts/idea is exciting and\nchallenging.",{"type":18,"tag":19,"props":48,"children":49},{},[50],{"type":23,"value":51},"That is why I am so in love with engineering, for me its the right discipline\nwhich deals with designing processes to achieve those visions. Channelizing\nthoughts from a sketch to a first prototype is a reward in itself. Throughout\nmy experience, I have always found that people who have a hobby of doing\npersonal projects have different approach to a problem solving. They seem to\nhave clearer and wider perspective of the problem. They are also more\npractical in their approach and do not hold on to thoughts with a fear of\nfailure. May be its because they have dealt with more failure than anyone in\ntheir lifetime. Overall, they are highly self-motivated and off course they\nare rare.",{"type":18,"tag":19,"props":53,"children":54},{},[55],{"type":23,"value":56},"Self-motivation is the core behind personal projects because you have to deal\nwith no one but yourself in terms of quality and deadlines. In my own\nexperience, an individual goes through thousands of ideas before they settle\nfor one which they find worth trying to achieve.",{"type":18,"tag":19,"props":58,"children":59},{},[60],{"type":23,"value":61},"Currently, there is so many project ideas stacked inside my mind which I hope\nto achieve one by one. And off course I will achieve them in time, as I have\nnever failed to try out my ideas.  They just have to wait their turns. Some\nideas remain for months and years, some for minutes and some simply never\ncomes out of its cocoon.",{"type":18,"tag":19,"props":63,"children":64},{},[65,67,71],{"type":23,"value":66},"My first project as far as I remember was making a \"home work diary\" and \"self\ndictionary of new words\". This must be when I was in class 3, where home work\ndiary was still not in the trend so I had to cut white A4 size papers into\nsquare form and tie it down with threads. Soon, I decided to make the form\ncircle and I think I was very much pleased by the eccentricity of the design.\nOffcourse, flaunting it among your friends was more fun. Prior to these, I do\nuse to collect a lot of Super Hero stickers of superman and batman. :)",{"type":18,"tag":68,"props":69,"children":70},"br",{},[],{"type":23,"value":72},"\nKeeping a \"dictionary\" was much more simple - I just had to get a notebook and\nwrite every new words and their meaning into it.",{"type":18,"tag":19,"props":74,"children":75},{},[76],{"type":23,"value":77},"Beside these, I believe drawing and painting was my key hobby coupled with\nexcessive LEGO structure building, limited by only few hundred pieces. I also\nremember getting a clean notebook and attempting to copy down the whole story\nof \"Goldilocks and 3 bears\". Then making your own \"scrabble\" board was fun\ntoo. I think these attitude made me more self reserved and self satisfied. The\nhabit of getting lost in your own world has remained with me since then.",{"type":18,"tag":19,"props":79,"children":80},{},[81],{"type":23,"value":82},"Its interesting to remember all those school days where I had my school work +\npersonal work. Many friends thought I was too studious spending time studying\nbut people rarely knew I spent time on my own personal work. Two of them\nrarely met with each other, until after my Olevels where I was more into\nstudying science and mathematics. So what ever I studied had relevance to my\npersonal work.",{"type":18,"tag":19,"props":84,"children":85},{},[86],{"type":23,"value":87},"During my school days, I did lot of sketching ideas into paper. After many\nyears those would help me understand engineering drawing classes much better,\nand it still does. It was also during those school days, where I stumbled upon\na skill to create stop motion animation in diary. Soon my diary was filled\nwith drawings at every corner.",{"type":18,"tag":89,"props":90,"children":91},"h2",{"id":7},[92],{"type":18,"tag":26,"props":93,"children":96},{"href":94,"rel":95},"http://3.bp.blogspot.com/-fFWzxl_fxKY/TnY_NOAW1JI/AAAAAAAAA9Q/MoVJ2U_sVls/s1600/DSC03083.jpg",[30],[97],{"type":18,"tag":98,"props":99,"children":101},"img",{"alt":7,"src":100},"http://3.bp.blogspot.com/-fFWzxl_fxKY/TnY_NOAW1JI/AAAAAAAAA9Q/MoVJ2U_sVls/s400/DSC03083.jpg",[],{"type":18,"tag":19,"props":103,"children":104},{},[105],{"type":23,"value":106},"One of my electronic projects.",{"type":18,"tag":19,"props":108,"children":109},{},[110],{"type":23,"value":111},"Once I was in colleges, my personal projects started becoming more complex and\nusually took months of working on it. The project would be virtually anything\nfor me : sketching a portraits, learning complex guitar composition, making\ncomputer software, building hardware prototypes of electronic kits,\nexperimenting with ideas of expressing better, writing novel, composing your\nown songs. I don't know but the range of project never seems to correlate and\nwas more of gamut of random artistic pleasures.",{"type":18,"tag":19,"props":113,"children":114},{},[115],{"type":23,"value":116},"I think all these personal projects have become and expression of myself.\nEvery idea some how found its way out in different form and medium. Also many\nideas still remain unexpressed. I don't remember a day where I am not thinking\nof projects. Its there, hard coded in my nature. I would have compulsive\ndesire to achieve and challenge.",{"type":18,"tag":19,"props":118,"children":119},{},[120],{"type":23,"value":121},"The top image is that of a \"Starship Enterprise\" which I must have spend hours\nand hours drawing in my copies and books, where ever possible. I was a big fan\nof Captain Krik and his companions. May be it was my innate desire, to have my\nown voyage to unknowns and keep exploring, not with a goal to find an answer\nbut to simply carry on exploring.",{"type":18,"tag":123,"props":124,"children":125},"blockquote",{},[126],{"type":18,"tag":19,"props":127,"children":128},{},[129,135],{"type":18,"tag":130,"props":131,"children":132},"em",{},[133],{"type":23,"value":134},"Space: the final frontier. These are the voyages of the starship",{"type":18,"tag":130,"props":136,"children":137},{},[138,140,146],{"type":23,"value":139},"Enterprise. Its five-year mission: to explore strange new worlds, to seek\nout new life and new civilizations, to boldly go where",{"type":18,"tag":141,"props":142,"children":143},"strong",{},[144],{"type":23,"value":145},"no man has gone\nbefore",{"type":23,"value":147},".",{"title":7,"searchDepth":149,"depth":149,"links":150},2,[151],{"id":7,"depth":149,"text":7},"markdown","content:blog:personal-projects.md","content","blog/personal-projects.md","blog/personal-projects","md",1719998059134]