[{"data":1,"prerenderedAt":88},["ShallowReactive",2],{"content-query-g2sPBnFaeD":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":82,"_id":83,"_source":84,"_file":85,"_stem":86,"_extension":87},"/blog/the-day-i-dreamt-of-becoming-someone","blog",false,"","The day I dreamt of becoming someone","tag:blogger.com,1999:blog-8061911113731935185.post-2847719308095785424","the-day-i-dreamt-of-becoming-someone","2016-01-02T11:04:00.003-08:00","post",{"type":14,"children":15,"toc":79},"root",[16,33,39,44,49,60,74],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://2.bp.blogspot.com/-Af1r5x9zH8A/VogQ2oHSxqI/AAAAAAAABks/kzbSKbPn3Lw/s1600/IMG_2947.jpg",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"https://2.bp.blogspot.com/-Af1r5x9zH8A/VogQ2oHSxqI/AAAAAAAABks/kzbSKbPn3Lw/s640/IMG_2947.jpg",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","Reading a story is like pealing an onion, each chapters reveal new secrets and\nshow their hidden layers. Everyone has their own story to tell, that is\nmysteriously connected with the stories of millions of other people living or\ndead in this planet. We think ourselves as an individual with our own identity\nand conscience, but NO, we are connected beings not with DNA or through our\nblood lines - but through our stories. Stories are at the heart of our being,\nand they are our reasons of living. The physical being of us has no meaning,\nbut as a connected being with millions of other stories, we individually play\nan important role. So here is my story of dreaming.",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"Story doesn’t begin when we are born, or when we are given a name by the\nalmighty holy priest. It beings when we all hit by our consciences that pushes\nus to make a decision that transpires our story and defines our character and\nrole in this world. For some it begins early, but for some it begins late.\nHowever, it always beings with a clear thought of what you want to become. At\nthat moment of discovery, you find reasons and that alone motivates you to\nmove ahead.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"For me, I know exactly when it began and I feel grateful that still remember\nthat moment. It was a lazy afternoon, we were  inside a sunny and warm\nclassroom. All of us had our books opened to a new chapter which we were about\nto read and the teacher was just beginning to start the class. The chapter\nread - “The life of Leonardo Da Vinci.”",{"type":17,"tag":18,"props":50,"children":51},{},[52,54],{"type":37,"value":53},"The teacher went us to tell us how Vinci would stare at the sky for long hours\nobserving birds fly and would sketch them. Later he would design a prototype\nof a flying machine - the blueprint for the aviation industry. This was a\nstory about a man who encompassed passion for life through his arts and\ninventions. That moment I knew what I wanted to be - I wanted to be like\n",{"type":17,"tag":55,"props":56,"children":57},"strong",{},[58],{"type":37,"value":59},"Leonardo Da Vinci.",{"type":17,"tag":18,"props":61,"children":62},{},[63,65,72],{"type":37,"value":64},"So I tried being like him, and building my own ",{"type":17,"tag":22,"props":66,"children":69},{"href":67,"rel":68},"http://www.bexdeep.com/2011/04/passion-about-flying.html",[26],[70],{"type":37,"value":71},"little experiment to\nfly",{"type":37,"value":73},". His story\nintroduced me to some new words. So after I reached home I start looking for\nits meaning they were physics and engineering. It was clear I had to know\nthese stuffs too in order to become him. Little did I know that the world had\nchanged so much since his being. But even then his stories entangled with me\ngiving me a new meaning. And thats how the story begins.",{"type":17,"tag":18,"props":75,"children":76},{},[77],{"type":37,"value":78},"I don’t think anyone in that class was affected as strongly as I was. And till\ndate, I am still affected by Leonardo Da Vinc. The only string of thread that\nconnects my story with his, is the passion for art and inventions. This\npassion is more towards “doing something” on the contrary to “knowing\nsomething”. The story for me was about achieving something in life to leave\nbehind new stories. It was the spark that was fired by desire to achieve\nsomething. After that day, every thing that I have done till date ties up to\nthat fine lazy afternoon in the class - dreaming of being some one.",{"title":7,"searchDepth":80,"depth":80,"links":81},2,[],"markdown","content:blog:the-day-i-dreamt-of-becoming-someone.md","content","blog/the-day-i-dreamt-of-becoming-someone.md","blog/the-day-i-dreamt-of-becoming-someone","md",1719046427467]