[{"data":1,"prerenderedAt":94},["ShallowReactive",2],{"content-query-9PdJwjCyqJ":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":88,"_id":89,"_source":90,"_file":91,"_stem":92,"_extension":93},"/blog/why-predict","blog",false,"","Why Predict?","tag:blogger.com,1999:blog-8061911113731935185.post-3303411020743482234","why-predict","2008-09-22T02:47:00.000-07:00","post",{"type":14,"children":15,"toc":85},"root",[16,33,46,60,65,70,75,80],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://2.bp.blogspot.com/_UYUaEitRq54/SQsjJVuDeoI/AAAAAAAAALs/CyamI6LK9sM/s1600-h/dice_stocks.jpg",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://2.bp.blogspot.com/_UYUaEitRq54/SQsjJVuDeoI/AAAAAAAAALs/CyamI6LK9sM/s320/dice_stocks.jpg",[],{"type":17,"tag":18,"props":34,"children":35},{},[36,44],{"type":17,"tag":22,"props":37,"children":40},{"href":38,"rel":39},"http://en.wikipedia.org/wiki/Albert_Einstein",[26],[41],{"type":42,"value":43},"text","Einstein ",{"type":42,"value":45},"once argued that it\nis possible to predict the future outcome, with 100% accuracy, of any event if\nthe initial values of all the variables were known. But its this very\nparticular requirement that makes the task impossible, the task of having to\nknow the values of all the variables.",{"type":17,"tag":18,"props":47,"children":48},{},[49,51,58],{"type":42,"value":50},"There is a theory contradicting the above statement, and its call ",{"type":17,"tag":22,"props":52,"children":55},{"href":53,"rel":54},"http://en.wikipedia.org/wiki/Uncertainty_principle",[26],[56],{"type":42,"value":57},"Principle\nof Uncertainty",{"type":42,"value":59},". It states\nthat it is impossible to measure the accurate value of any system. The reason\nmainly being that the more your try to be accurate, the more you tend to\naffect the system's parameter. It was mainly argued that this was due to the\nimperfections in the measuring instrument. No measuring instruments are\naccurate and this seems to be the undeniable truth. For example, its quite\nimpossible to measure the flow of the river without affect the flow itself.",{"type":17,"tag":18,"props":61,"children":62},{},[63],{"type":42,"value":64},"Therefore, many complicated mathematical theorems have been established to\npredict the values instead of measuring it. But, there is problem with this\nmethod: Its only a prediction, giving you not the accurate values but the\nprobability on the values. And this seems to be a new age of interpreting the\nvalues, that is, in terms of percentile. For example, what is the probability\nthat it will rain tomorrow. Its a simple question that can be answered by\nobserving a clouds or analyzing the previous data on the behavior of the\nseasons and finally you may say there is 50-50 chance for raining tomorrow.",{"type":17,"tag":18,"props":66,"children":67},{},[68],{"type":42,"value":69},"So how do we predict? First we have to understand the system that you are\ntrying to predict. If its a weather, you have to have the models of your\nenvironment like location of clouds, values of temperature and so on. Once you\nhave almost complete model on your environment, you can make few prediction\nbasis on your analysis of the data provided. Therefore, the data processing\nand data interpretation seems to be the core of predicting the values of the\nquantities.",{"type":17,"tag":18,"props":71,"children":72},{},[73],{"type":42,"value":74},"Can we justify our predictions? Yes, we can justify it because we know that in\na system, variables are dependent with each other and further there is an\nunderlying relationships between them. This relationship between the variables\ncan be found out by collecting data and applying statistical tools like\ncorrelation and so on.",{"type":17,"tag":18,"props":76,"children":77},{},[78],{"type":42,"value":79},"But there are many problems with this method so it is not that easy to create\na model of any system. Lot of details has to be considered, like the source of\nthe data and its authenticity. Also, the data must be collected in such a way\nthat it won't disturb the nature of the system. For example, if you want to\nget a detail on popularity of the brand then its very likely that the people\nwill not be able to give their own choice. It may be because he/she can be\ninfluenced by others choice. This is only a very few problems associated with\ndata collection. So its another field of research, how to get an exact data,\nalso don't forget the uncertainty principles.",{"type":17,"tag":18,"props":81,"children":82},{},[83],{"type":42,"value":84},"We will be off course talking a lot on the statistical tools that can be used\nto model the system. But for now it is reasonable to say that \"Its better to\npredict accurately then to measure inaccurately\".",{"title":7,"searchDepth":86,"depth":86,"links":87},2,[],"markdown","content:blog:why-predict.md","content","blog/why-predict.md","blog/why-predict","md",1719047579152]