[{"data":1,"prerenderedAt":48},["ShallowReactive",2],{"content-query-4c7AB7YKBd":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":42,"_id":43,"_source":44,"_file":45,"_stem":46,"_extension":47},"/blog/creative-desire","blog",false,"","Creative Desire","One of the difficulty of being creative is not being able to conform with the\nsurrounding. Almost every thing around you starts to become an extension of\nyourself. Every living and non-living things become a part of you and you try\nto make sure that it is the part of your conscious extension. An urge which\npushes you to define your surrounding space.","tag:blogger.com,1999:blog-8061911113731935185.post-8165781153077174571","creative-desire","2011-03-02T08:56:00.000-08:00","post",{"type":15,"children":16,"toc":39},"root",[17,24,29,34],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27],{"type":23,"value":28},"Some people say that Artist is born with an ego which is unsatisfiable. This\nego does not have any rule and boundaries and is very moody in its nature. It\nhas no value proposition to the society. It simple exist within the realm of\nego of an Artist. You can see the example everywhere in the history of\ncreativity from Leonardo to modern artists. It is the only think which I have\nfound that defines an Artist, in a good way.",{"type":18,"tag":19,"props":30,"children":31},{},[32],{"type":23,"value":33},"But this urge to define your space can be a frustrating experience when it\ndoes not conform with your command. I don't know why this urge is so strong\namong creative people. It simply doesn't obey the rules and breaks the\nboundary of thoughts. It simply stands as the only reason to be living and\nthis can be very troublesome, sometime. But I think you should never doubt\nyour creative urges and move along with.",{"type":18,"tag":19,"props":35,"children":36},{},[37],{"type":23,"value":38},"Many creative people living among us has a very hard time fitting into the\nrealm of life, but I see everyone living for only their extension. Its like\ntrying to do everything just to save your identity. It may be not the only\nhelplessness of creative people but also to some extent nature of general\nhuman being.",{"title":7,"searchDepth":40,"depth":40,"links":41},2,[],"markdown","content:blog:creative-desire.md","content","blog/creative-desire.md","blog/creative-desire","md",1719050484618]