[{"data":1,"prerenderedAt":122},["ShallowReactive",2],{"content-query-AJnViWpCz4":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":116,"_id":117,"_source":118,"_file":119,"_stem":120,"_extension":121},"/blog/some-crazy-stuff-finding-reasons","blog",false,"","Some crazy STUFF : Finding Reasons","During my college, I use to sometime write some crazy stuff out of no where. I\nguess I really wanted to tell a story like no one else and bring that level of\nexperience. After many years, today I seem to have understood this art better.\nOne of my friend use to tell me that being an artist its a life long passion\nto understand what works and what doesn't. Keep pursuing it.","tag:blogger.com,1999:blog-8061911113731935185.post-3450473442665841587","some-crazy-stuff-finding-reasons","2012-03-28T11:16:00.001-07:00","post",{"type":15,"children":16,"toc":113},"root",[17,24,33,47,59,64,69,89,94,99,104],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27,29],{"type":23,"value":28},"For this reason, I had started writing vigorously. These days I am bit down on\nmy writing, but I am exploring it in much deeper sense than before. My diaries\nwere filled with thoughts and only thoughts. Sometime, I would just start\nwriting on my computer and leave it no where. You know, simply write and keep\nwriting. As a result, I did complete one novel :) which related to an\nexperience shared with my friends during one hiking, but I tried to make it\nmysterious and mythological. Well some day I might share that too :) But for\nnow, I am just posting one very long, almost half baked story which I think\nwrote almost 4 years back. Enjoy but don't sleep ",{"type":18,"tag":30,"props":31,"children":32},"d",{},[],{"type":18,"tag":19,"props":34,"children":35},{},[36],{"type":18,"tag":37,"props":38,"children":42},"a",{"href":39,"rel":40},"http://2.bp.blogspot.com/-yCVJIVrNARk/T3NVWr6bXRI/AAAAAAAABA4/ILeEd18p_CI/s1600/finding_reasons.jpg",[41],"nofollow",[43],{"type":18,"tag":44,"props":45,"children":46},"img",{"alt":7,"src":39},[],{"type":18,"tag":19,"props":48,"children":49},{},[50],{"type":18,"tag":37,"props":51,"children":54},{"href":52,"rel":53},"http://1.bp.blogspot.com/-7LgjgSEJf1w/T3NTh7XocwI/AAAAAAAABAo/Hu0GIKZDz8Y/s1600/IMG_3339.JPG",[41],[55],{"type":18,"tag":44,"props":56,"children":58},{"alt":7,"src":57},"http://1.bp.blogspot.com/-7LgjgSEJf1w/T3NTh7XocwI/AAAAAAAABAo/Hu0GIKZDz8Y/s320/IMG_3339.JPG",[],{"type":18,"tag":19,"props":60,"children":61},{},[62],{"type":23,"value":63},"Far way from the hustle and bustle of the city, laid a small settlings. With\nits beauty, it decorated the whole barren terrain and made it look like\nheaven. With colorful flowers blooming with happiness, the place had a\nwonderful flavor in its environment. The place was filled with serenity. Even\nthe noises made by the children and the people blended itself with the nature,\nsounding harmonious. Each whisper could be heard independently, it was that\nclear. It was like looking through the crystal ball where you could see and\nhear everything. This made the place mystical.",{"type":18,"tag":19,"props":65,"children":66},{},[67],{"type":23,"value":68},"A little away from the crowd, there was a beautiful cottage. It was owned by\nMiss Angeli that was what everyone called her. She had moved to the place many\nyears ago and had started by being a teacher. She had gained a respectable\nposition in the village. After her arrival, she had managed to change a lot in\nthis small village by bringing the lost happiness and hope in everyone’s life.\nNow she was on her eighties and was still strong. People found her amazingly\ncheerful. When she walked on the street, each would greet her and cater help.\nShe had devoted her life to the welfare of the society. But no one new her\nbackground and people never cared to ask her. For them she was an angel\ndropped from the heaven.",{"type":18,"tag":19,"props":70,"children":71},{},[72,74,80,82,87],{"type":23,"value":73},"[![](",{"type":18,"tag":37,"props":75,"children":78},{"href":76,"rel":77},"http://1.bp.blogspot.com/-0YqKp5yvAEo/T3NT1an68aI/AAAAAAAABAw/BJ-",[41],[79],{"type":23,"value":76},{"type":23,"value":81},"\nQXopML8Y/s320/IMG_3157.JPG)](",{"type":18,"tag":37,"props":83,"children":85},{"href":76,"rel":84},[41],[86],{"type":23,"value":76},{"type":23,"value":88},"\nQXopML8Y/s1600/IMG_3157.JPG)",{"type":18,"tag":19,"props":90,"children":91},{},[92],{"type":23,"value":93},"As with everything, there was a myth about her life. Some said she was a\ndaughter of god, sent to help; some would say she was a lost child of a god.\nEveryone had their own version but they were never near to the truth. The\ntruth was as usual far simpler then all the misinterpretation. When she had\narrived at the village, she was in her thirties. She was as beautiful as an\nangle. When she walked on the streets, each passer-by would turn their head to\nget a glimpse of her beauty. Soon her simplicity attracted many people. She\nreceived many marriage proposals but she never accepted them. She did not like\nhurting others but she had some how restricted herself from involving in a\nrelationship. As the years passed, she stopped receiving proposal. The people\nrespected her choice and never questioned her. Some would interpret her choice\nby saying a god’s child must stay pure and scared. Though she was respected by\nmany people, she never let any one too close to her. She did not have single\nfriend with whom she would open herself. She lived a life like those of nuns\nbut without taking any oaths or committing her selves to any promises. She was\nsimply what she was. There was no code of conduct to be followed. More\ninterestingly, no one had ever entered her room, except for the little\nchildren whom she tutored. When children were queried about her home, they\nwould say things that were as obvious like: “The home is just as simple as she\nis.” “It’s too normal to be described.” And in reality, it was simple. There\nwas nothing mysterious about her neither about her lifestyle. But as she grew\nolder, people accepted her mysterious life style and got used to it.",{"type":18,"tag":19,"props":95,"children":96},{},[97],{"type":23,"value":98},"But now, after almost fifty years of silence, she had finally decide to speak\nto the crowd. No one had asked her to do so but she told everyone that she had\nto tell her story. She said it was the right time. Suddenly after so many\nyears, the lost interest in her lifestyle was rejuvenated. She had planned to\ntalk at the ground of the school. Everyone was invited to it. The garden of\nthe school was cleaned to perfection. The children had all helped to put a big\ntent under which the talk was to be preceded. The food was served to everyone.\nIt was as if a huge marriage ceremony was being held.",{"type":18,"tag":19,"props":100,"children":101},{},[102],{"type":23,"value":103},"As the time approach for her to speak, the silence started to grow. People\nwere slowly moving towards their chairs. Even the wind had stopped, as if to\nlisten. The place had already gathered a mystical aura. Soon she appeared to\neveryone’s sight. With her withered hands holding, what seems to be a small\ndiary, she gracefully moved towards the microphone. She had worn a light green\nsari which matched her personality. Those who had seen her in her youths would\nsay that she had not changed a bit. As she stood in front of everyone, she\nwatched them and slowly smiled. Then she carefully unfolded her diary and\nstarted to speak.",{"type":18,"tag":19,"props":105,"children":106},{},[107],{"type":18,"tag":108,"props":109,"children":110},"span",{},[111],{"type":23,"value":112},"Image : Took them @ Rampur Chitwan",{"title":7,"searchDepth":114,"depth":114,"links":115},2,[],"markdown","content:blog:some-crazy-stuff-finding-reasons.md","content","blog/some-crazy-stuff-finding-reasons.md","blog/some-crazy-stuff-finding-reasons","md",1719049481423]