{"_path":"/blog/black-hole-of-normality","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Black Hole of Normality","description":"Black Hole!! A very mysterious element of our universe. Science has it, that\nit engulfs every existence of mass around it and takes them to singularity.\nApparently, singularity is a point in a space where every physical law\ncollapses.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-8471016773680900686","slug":"black-hole-of-normality","publishedDate":"2011-01-07T12:02:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Black Hole!! A very mysterious element of our universe. Science has it, that\nit engulfs every existence of mass around it and takes them to singularity.\nApparently, singularity is a point in a space where every physical law\ncollapses."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But here, I will not delve over the singularity of black hole. Instead I will\npoint you towards the interesting phenomenon of human behavior. Its the black\nhole of normality. Its a place where every human being is pulled to become\nnormal and insignificant. Its a space where most human being delve into and\ngets lost into the rules of normality and only few can struggle to come out of\nit."}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://bruceleeeowe.files.wordpress.com/2009/11/blackhole.gif","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://bruceleeeowe.files.wordpress.com/2009/11/blackhole.gif"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"source : google.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nYou may be getting my point. If not let me elaborate. Every human being is\ngiven an opportunity to do something different and great. I think everyone has\nthat right and opportunity in their life time to act."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But some how the black hole of normality pulls them into it to succumb. And\nyes, I mean to literally succumb. Its a poor dilemma of human beings but I\nthink only few can break it. The pull of normality is so strong its\nunavoidable. But I have no offense to it. I think moving towards the normality\nis the nature of human beings and only few have enough strength to go against\nit. But few who go against it in a right way or wrong way are always glorified\nby the society. There are many examples in the history about it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just like many laws, the fundamental principle is that every thing wants to\nspiral down to stability. Chemical reaction happens because the final state of\nthe reaction is more stable than that of initial. Similarly look at many\nprinciples of physics, starting with motion of inertia - every mass wants to\nbe in a state that they are until and unless an external force is being\napplied on them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Similarly the black hole of normality acts on a similar way at human being.\nEvery human beings are attracted by this law to be normal. For years in my\nwork and life, I have experienced people delving into normality easily. And it\ntakes a lot of vision to pull them back to move forward boldly. But\nultimately, many human beings fail to resist the stability of normality."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I don't know how much sense I am making to you. But you are getting my point\nthen I am more than pleased. Resisting stability is very difficult for many\nreasons. Political, economical, personal and many others. But I just want to\nurge that if you want to reach to greatness in any terms or in any\nphilosophical way, you need to identify this black hole of normality before it\nengulfs you by surprise. Moreover, make sure that you are not already inside\nthe belly of black hole. If you are then you have every opportunity to come\nout of it, just don'r surrender."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:black-hole-of-normality.md","_source":"content","_file":"blog/black-hole-of-normality.md","_stem":"blog/black-hole-of-normality","_extension":"md"}