{"_path":"/blog/aspect-of-form-and-design","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Aspect of Form and Design","description":"Design is an adaptation of features into form - be it anywhere. There two\ntypes of form which comes to my mind- one is with features and the other is\nwithout features. Now, you may say what is the difference between these two\nthings? But it is the very difference which takes my thoughts from being\npractical to highly philosophical.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-1341622888041638566","slug":"aspect-of-form-and-design","publishedDate":"2009-09-12T15:49:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Design is an adaptation of features into form - be it anywhere. There two\ntypes of form which comes to my mind- one is with features and the other is\nwithout features. Now, you may say what is the difference between these two\nthings? But it is the very difference which takes my thoughts from being\npractical to highly philosophical."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you look around yourselves, you will find that everything has a form.\nStarting from your own hands - five fingers in each hands with specific\nreasons. The shape of chair you sit on, the brush you use to brush your teeth,\nthe mobile you use to communicate and so on. All these human made forms are\ndesigned with every aspect of solving a problem."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On the other hand, there are certain forms which are featureless and don't\nsolve any problems. Music and Art are one of these areas which I am referring\ntoo. Music is a form of your emotions and its an expression of your thoughts,\nsimilar goes to your art. But what is the whole purpose of these form?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cymatic is a particular field of study that is trying to bring the visual form\nto sound. But what purpose would that form provide, beside the visual\npleasure. Like energy, form can be converted from one to other. If you look\ninto these images than you will find that these images find itself into a\nfractal community - the subject of randomess and chaos. I told you earlier\nthat this is a featureless form or you can say in other words a pure form."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nature in itself is a manifestation of energy into form, but for what purpose.\nBut every natural form are efficient and beautiful at the same time. What\ntriggers you when you look into these forms below."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"["},{"type":"element","tag":"img","props":{"alt":"","src":"http://www.world-mysteries.com/sci_cym1.gif"},"children":[]},{"type":"text","value":"]("},{"type":"element","tag":"a","props":{"href":"http://www.world-","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.world-"}]},{"type":"text","value":"\nmysteries.com/sci_cym1.gif)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orderness, isn't it? Finding an impeccable order into chaos really triggers\nour inner self and makes us feel something strange. Millions of people\nconfined in a limited space have resulted in a complex and yet organised\nsociety is an order in chaos. Our own economic system which is highly\ncomplicated in itself is an order in chaos. Similarly, our universe is an\norder in chaos."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Chaos is something we cannot comprehend, therefore even if its a randomly\nscattered stars in night, we have delicately grouped each one and have defined\nthem. Its not only to define form but also create forms that we live to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The theory of form and design is not limited to shapes and sizes but also to\nthe ideology. Each one of us have their own view and thus there is a conflict\nbetween different ideology - this is chaos. That is why there is war which\ntries to bring this whole chaotic ideology into one form - one freedom, one\ndemocracy."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Every conversion between form requires a huge struggle - war is one of them.\nIn case of practical problem solving its the struggling in the mind which\ntries to make sense of the chaos and bring out the solution. Problem solving\nin itself in an art of finding order in chaos - be it any problem."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though the featureless forms introduces many philosophical problems, their\nimportance cannot be undermined. But every form or design must be solving\ncertain delicate problems be it building a house or painting your thoughts.\nArt may be the form or solution to the chaotic mind of ours."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:aspect-of-form-and-design.md","_source":"content","_file":"blog/aspect-of-form-and-design.md","_stem":"blog/aspect-of-form-and-design","_extension":"md"}