{"_path":"/blog/fearful-consumer-market","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Fearful Consumer Market","description":"Consumer market is something, I always feared. During my engineering days, I\nknew it was one area where I would not find myself working. I always feared\nthe harsh competition of the market. I worried if ever, anything I made would\nsustain in the market. Or how people would react to it? You can say, I feared\ncriticism and all the yap yap of group of people, who knows only how to\nsuggest but not to act. Thus, I kept my interest into custom projects and not\nrelated to anything that a single consumer would use, rather it was something\nof community service. But with changing time, I knew I had to make a plunge\ninto the ocean of consumer market and face the competition. \"Be a man! Dude\"\nThat is what I would say to myself. I knew I couldn't swim, but I had to give\nit a try.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-8549143136419780178","slug":"fearful-consumer-market","publishedDate":"2009-04-20T23:48:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consumer market is something, I always feared. During my engineering days, I\nknew it was one area where I would not find myself working. I always feared\nthe harsh competition of the market. I worried if ever, anything I made would\nsustain in the market. Or how people would react to it? You can say, I feared\ncriticism and all the yap yap of group of people, who knows only how to\nsuggest but not to act. Thus, I kept my interest into custom projects and not\nrelated to anything that a single consumer would use, rather it was something\nof community service. But with changing time, I knew I had to make a plunge\ninto the ocean of consumer market and face the competition. \"Be a man! Dude\"\nThat is what I would say to myself. I knew I couldn't swim, but I had to give\nit a try."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Journey into the consumer market is like that of 20000 Leagues Under The Sea.\nThere are so many different kinds of creatures around to look and be\nfascinated. Some are small living in tiny groups. Some are sharp predators\nchasing and making a hunt, they would kill you if they want, it depends on how\nmuch threat you pose to them - or how hungry they are. There are herbs and\nmany different kinds of plants that grow organically and animals feed on them.\nThese are harmless and friendly. And there are giants like whale which no one\ncan touch or poke around, they have been living there for ages and will remain\ntheir more. These giants neither rule nor control anything, they are just\ntheir, making their presence- completing an ecosystem. Then there are some\nfreaky looking creatures -like squid (which can be as large as ships)- which\nmakes you puke, but yes they are there too. You can't ignore them. They stare\nright into your eyes as if they can read your mind. These creatures act like\nparasite and feed on dead, sometime they eat their own kind too."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Then there are mythological creatures which exist if you want them too.\nEveryone fears them but we know they only exist in our mind. Well, the last\nkind is the most fearless of all, its sharks, its strong, powerful, agile and\nquick on instinct. They virtually rule the sea. There are more of it but they\nrarely interfere with each other, but when they do, its a fight the whole\nworld watches in amazement. But, its not always this way, there are among\nthese predators and giants, an intelligent being, an innovative and highly\ncreative creatures which are changing the way of life at sea. These are the\nbeing which marks a change and the change that is truly for good."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So far, I have only reached till here. My journey is beginning to take shape\nand form a story. Slowly I can see a transformation in me, and the\ntransformation is subtle. I wonder which creature I would transform into. Its\na long journey but a beautiful one. There is a difference in growing in a\ndepth of ocean and growing inside a protective glass."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I can only sing a song by Beatles:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I'd like to be under the sea"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In an octopus' garden in the shade"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"He'd let us in, knows where we've been"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In his octopus' garden in the shade"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I'd ask my friends to come and see"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"An octopus' garden with me"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I'd like to be under the sea"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In an octopus' garden in the shade."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:fearful-consumer-market.md","_source":"content","_file":"blog/fearful-consumer-market.md","_stem":"blog/fearful-consumer-market","_extension":"md"}