{"_path":"/blog/lego-movie-was-so-awesome-that-i-decided-to-blog-about-it","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Lego movie was so awesome that I decided to blog about it","description":"[![](http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-\nSGpI/s1600/maxresdefault.jpg)](http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-\nSGpI/s1600/maxresdefault.jpg)","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-3431367343431885706","slug":"lego-movie-was-so-awesome-that-i-decided-to-blog-about-it","publishedDate":"2014-02-23T21:39:00.003-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"[![]("},{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-","rel":["nofollow"]},"children":[{"type":"text","value":"http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-"}]},{"type":"text","value":"\nSGpI/s1600/maxresdefault.jpg)]("},{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-","rel":["nofollow"]},"children":[{"type":"text","value":"http://3.bp.blogspot.com/-FLwvmYbYbnY/Uwra3CLuz9I/AAAAAAAABZI/uWtyOE-"}]},{"type":"text","value":"\nSGpI/s1600/maxresdefault.jpg)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Lego movie was awesome is so many different levels. As a kid who grew up\nplaying lego, the movie was an absolute treat. Not to forget the presence of\nBatman, which made it super awesome."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is not really a review of the movie. But instead the thread of emotions\nand flashbacks which forced me to blog about it. The movie has some very\nstrong analogy to life which has been weaved around the characters that really\nmakes it stand out. It has two strong themes running throughout the movie -\nTHE INSTRUCTION SETS and THE KRAGEL(a super-glew)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I got my first lego set when I was around 5 years old. The year should be\naround 1990 because I strongly remember the logo of that year's world cup\nfootball. The theme of the set was PETROL pump. It consisted of one petrol bus\nand one petrol station. The moment I opened it I was so sure what to do with\nit. The set had an instruction set which gave description on how to connect\nthe pieces to build the set. I think it came very naturally to me about the\ndynamics of connecting the pieces and building something out of it. After my\ndad bought the lego set for me, the set got quite popular in the\nneighbourhood. Soon most kids around the block had them and I was called upon\nby their parents to help their kids build the blocks (not to mention I was kid\nmyself). Some how not everyone could put the pieces together :). I went on to\nbuild full set of cargo helicopters for them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There is one most memorable and  mysterious story behind my first lego. When I\nopened it for the first time, one piece was missing from the set. It was a\nsmall piece that sat near the door of the petrol bus. No where could I find\nthat piece. But after few weeks while my dad was ploughing our garden he\nstumbled upon that piece buried in the mud. I still don't know how that\nhappened and still keep thinking about it. Must have been something to do with\nmy memory but I distinctly remember being quite surprised by the incident."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://2.bp.blogspot.com/-mi1HbbyA0I0/UwrbD8LPSfI/AAAAAAAABZQ/nqQqj1Mb4p0/s1600/masc1990.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://2.bp.blogspot.com/-mi1HbbyA0I0/UwrbD8LPSfI/AAAAAAAABZQ/nqQqj1Mb4p0/s1600/masc1990.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The other memorable incident is around the World cup football logo of 1990. If\nyou remember it is something kind of a lego. During that time, we didn't have\na TV so my dad usually took me to one uncle's house where we watched the\nfootball. When I saw the logo, there was an immediate response from my side to\nreturn home and try to recreate it from the lego set. This brings me to the\nfirst theme of the movie which is the idea behind the MASTER BUILDER and the\ninstruction set. In the movie there are a set of characters separate from\nnormal people known as MASTER BUILDER who basically doesn't need an\ninstruction set to build with LEGO set. The theme which basically encourages\nkids of think beyond the instruction sets and build on your own. The main\nprotagonist of the movie is, on the contrary, a normal consturction worker who\nhas spend his entire life following the instruction set and during the movie\nstumbles upon his hidden creativity to unlock the MASTER BUILDER in him. A\ntheme that definitely resonates with most creative people who are always\nstruggling to unlock their inner MASTER BUILDER."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During my childhood, I have spent hours playing with LEGO building all shorts\nof buildings and vehicles. There are few things which almost every lego player\nhas built in their life : a bat-mobile, a bat-bike, a bat-helicopter and a\nSPACE SHIP. During those years the TV batman show and STAR TREK was a popular\nshow. No wonder the presence of BATMAN character made all the sense- in his\nbat mobile. Hence there is an intended pun in the movie when the spaceship\ncharacter is always eager to build a space space but is always stopped by his\nfriends. But around the climax when he finally gets to make one, he simply\ngoes crazy and builds one. After that there is this hilarious moment where he\ngoes on to strike ever villain shouting \"SPACE SHIP SPACE SHIP\" "},{"type":"element","tag":"d","props":{},"children":[]},{"type":"text","value":" (brings all\nthe joy of being a kid.)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The second main theme of the movie is the KRAGEL which is actually a used\nsuper-glue which the main villian uses to call upon the destruction of the\nlego world. His main idea behind the destruction is that LEGO world needs to\nbe under some order and everyone needs to follow fixed instruction. Now I\nwon't give up more on the story as it is central to the movie theme. But the\nidea of kragel is just brilliant and also one reason why I was so excited to\nblog."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There was one time when I had to leave home to go for a school tour. During\nthat time, one of my uncle was visiting our home and had taken up my room to\nstay. When I returned from the tour (around 15 days) uncle had left but to my\nshocking surprise most of my lego pieces had been stuck together with super\nglue. It made me furious that uncle had tinkered with my lego set and fixed\nsome of the movable pieces. In anger I broke some of the pieces and may be\ngrumbled with mom for some days. I don't know exactly why my uncle had to glue\nthe set but this idea runs through the entire movie. If you have seen it you\nwill know exactly why this is an important theme in the movie "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During the end of the movie, when the main protagonist unlocks his inner\nMASTER BUILDER, its the scene to cheer. After which he makes this giant robot\nwhich goes on to save the world with an interesting twist to the end."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As I sat their watching the movie all these memories and parallel connections\noverwhelmed me. Though its been many years since I have made anything with\nlego but a dream to one day own every set still remains. As of now, I am more\nfocused  on to unlock the inner MASTER BUILDER within me to create something\namazing in the real world - a promise which ever kid makes to himself while\nthey are playing with the lego."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:lego-movie-was-so-awesome-that-i-decided-to-blog-about-it.md","_source":"content","_file":"blog/lego-movie-was-so-awesome-that-i-decided-to-blog-about-it.md","_stem":"blog/lego-movie-was-so-awesome-that-i-decided-to-blog-about-it","_extension":"md"}