{"_path":"/blog/collective-intelligence-an-interesting-thought","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Collective Intelligence : An Interesting Thought","description":"Here I was at the end of the week, and after a tiring Table Tennis match with\nBinit dai (brother in nepali) I walked with him to his flat. Till then I was\nunaware that I was about to have a very interesting conversation with him. And\nit all started with a vague question, \"Dai, when do you think Sharukh Khan\nwill die?\" I asked this question as I was watching his photographs in a daily\nnewspaper.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-5939092020170035559","slug":"collective-intelligence-an-interesting-thought","publishedDate":"2010-11-12T09:33:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Here I was at the end of the week, and after a tiring Table Tennis match with\nBinit dai "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"(brother in nepali)"}]},{"type":"text","value":" I walked with him to his flat. Till then I was\nunaware that I was about to have a very interesting conversation with him. And\nit all started with a vague question, \"Dai, when do you think Sharukh Khan\nwill die?\" I asked this question as I was watching his photographs in a daily\nnewspaper."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To this vague question, he replied \"Most celebrity have less life expectancy\ndue to their stressful lifestyle.\" Then he added, \"There is this basic formula\nfor life, the more you push in your life the less your lifetime becomes.\" Then\nhe added a scientific fact to the statement that the heartbeat per second\ndefines the total life expectancy. Large animals like elephant have very low\nheart beat rate compared to a rabbit, so comparatively elephants live more\nthan rabbits. In same lines, tortoise has a very low heart beat and it can\nlive up to 200 years. Then suddenly I remembered an old documentary about\nhuman body where it was mentioned that the main reason of aging is oxygen.\nThough oxygen is the life support of human being, it also has a double edge to\nit. Different form of oxygen is the main factor behind degradation of cells."}]},{"type":"element","tag":"h2","props":{"id":"httpwwwbrainbasedbusinesscomuploadscollective20intelligence-thumbjpghttpwwwbrainbasedbusinesscomuploadscollective20intelligence-thumbjpg"},"children":[{"type":"text","value":"[![]("},{"type":"element","tag":"a","props":{"href":"http://www.brainbasedbusiness.com/uploads/collective%20intelligence-","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.brainbasedbusiness.com/uploads/collective%20intelligence-"}]},{"type":"text","value":"\nthumb.jpg)]("},{"type":"element","tag":"a","props":{"href":"http://www.brainbasedbusiness.com/uploads/collective%20intelligence-","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.brainbasedbusiness.com/uploads/collective%20intelligence-"}]},{"type":"text","value":"\nthumb.jpg)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"brainbasedbusiness.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nAfter a long silence to this thought, I asked yet another vague question, \"Why\ndo human beings have to be so restless? Why are they always thinking and doing\nsomething? Can't we simply exist?\" To this he rebutted by saying that its not\nonly humans but every living organism has a quest in life to exist, and\ncontinuously act accordingly. He then gave examples of how dogs and rats have\nadapted to the city life and have made their existence possible. And this is a\ntrue fact. Look at dogs how gullible they are? They have pampered human being\nto such an extent that a dog that doesn't wag its tail in front of their boss\nis simply not a good dog. Look how they have made their ways into human lives\nand co-existing as a part of human family."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This was the turning point of the conversation. Suddenly, from a simple\nscientific observation we were venturing into the reality of life -\n\"Existence\". This is when he shared a remarkable fact about human cells.\nInside the cell we have something called "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"mitochondria"}]},{"type":"text","value":" (power house of\ncell). But in the history, mitochondria and a cell was a different life\nsystem. Unicellular organism usually feed by engulfing other cellular\norganism. So in some faith of life, a cell engulfed mitochondria but instead\nof digesting it, a remarkable thing happened. Both the cell and mitochondria\nco-existed as one organism. The presence of mitochondria somehow enhanced the\nefficiency of cell, so someway they communicated to exist as one or we may say\nagreed to be one. Now its very similar to a dog and a man, somehow the\npresence of a dog in a family have started to make a family complete, making a\npresence of a dog important. As the new generation of the family exist, so\nwill the dog's."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Every human cell has a unique identity of their own and is in a way an\nindependent life. But its remarkable to see how millions and billions of these\ncells have coordinated in a godly fashion to exist as a human being. How do\nthey know how to coordinate with each other. Who is commanding them? Because\nin all these examples there is no single commanding cells or identity\ninvolved."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For two human beings to coordinate, we have to communicate. Communication is a\nvery important part of a society. But in case of cells and other life forms,\nhow do they communicate with each other. What kind of consciousness do they\nhave?"}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://yerbamate.com/storage/cup%20of%20tea.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://yerbamate.com/storage/cup%20of%20tea.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"yerbamate.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nWith casual seep of tea and popcorn, the conversation was a perfect ice\nbreaker for some innovative thinking. So the next phase of this conversation,\nwas to dwell deep into the aspect of matter and their consciousness. Then\nBinit dai said that there is something that have always fascinated him about\nlife. The embroic process of human development is an interesting process.\nInitially, we have only one cell and the same cell multiply to be an embryo.\nBut how do each cell know which part of the body they want to be? What guides\ntheir faith is a question that is interesting? This suddenly reminded me about\nthe paradox of quantum theory. The fact that electrons show wave behavior has\nbaffled scientific community for ages. Out of this fact a very important\nquestion have emerged - \"During electron diffraction, how does one electron\nknow where to land and what guides the path of an electron.\" Now I know that\nthis has been explained by the wave nature of particle but it is an\ninteresting question which shows that somehow these matter can communicate\nwith each other is some interesting fashion."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is the point where everything started to go murky. The whole question\nboiled down to collective intelligence of life. The fact that earth in itself\nis a living organism could be hard to take it, but once you follow the path of\ncollective intelligence of how cell emerges to be human and human to community\nto Earth and may be to universe, it looks elementary. Though I have no\nevidence to prove, its an interesting thought to have."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This theory has an immense implication in every field. With this thought\nlingering in my mind, I looked at my cup to see it empty. So there it was a\ncup full of innovative thinking :). I jumped to my feet and left the flat\nleaving Binit dai to his thought and mine to jot down to this blog post. Hope\nyou enjoyed."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"httpwwwbrainbasedbusinesscomuploadscollective20intelligence-thumbjpghttpwwwbrainbasedbusinesscomuploadscollective20intelligence-thumbjpg","depth":2,"text":"[![](http://www.brainbasedbusiness.com/uploads/collective%20intelligence-\nthumb.jpg)](http://www.brainbasedbusiness.com/uploads/collective%20intelligence-\nthumb.jpg)"},{"id":"","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:collective-intelligence-an-interesting-thought.md","_source":"content","_file":"blog/collective-intelligence-an-interesting-thought.md","_stem":"blog/collective-intelligence-an-interesting-thought","_extension":"md"}