{"_path":"/blog/something-on-life","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Something on Life","description":"","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-2489126137057565761","slug":"something-on-life","publishedDate":"2008-09-12T06:54:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/_UYUaEitRq54/SMp0rouY3gI/AAAAAAAAABc/44qDroQcGo8/s1600-h/Life.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://3.bp.blogspot.com/_UYUaEitRq54/SMp0rouY3gI/AAAAAAAAABc/44qDroQcGo8/s400/Life.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"look at it. As I was playing with MSpaint, I made it just for fun. Then,\nsomebody comes and tells me, wow, is it an abstract art. I go \"Mmmmmm, I\ndonno.\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But he doesnot stop there, he pulls down the chair and sits and stares at it.\nI think you have portrayed a life. And I go LIFE!. How can it be life. Then he\ngoes away leaving me confused. Then I stay confused and totally flattered in a\nway. \"LIFE\" I am thinking. But how?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Then I draw the same in paper and try figuring it out. Life Huh. So I toss the\npaper, and see if I can see it. Nop not from this angle and I go and see from\nother angle. No no. I think I am getting something wrong. For about 15 minutes\nI stare at it like a zombie. Inside me there is this voice shouting \"LIFE\". If\nI can just see it. But no. I get frustated. I try coloring it and making it\nlook as stupid and as abstract but I have no success. I go as far as I can. I\nburn it. I tear it. I flip it. I take it near to the mirror. It try to look at\nit from different perspective. I try to create a mathematical equation for it\nbut still no Life. Dammn. I must be a fool. How can he see it but not me."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After much frusted hours I look back at it and see its no longer what I made\nit before. It is no longer so simple. Now it has become more complex and\nabsurd and totally stupid. I give it one more glance. Then I realize\nsomething. I smile to myself. I tear the paper off and walk out of the room. I\nam satisfied, I think to myself. Now I see the Life. Can you?"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:something-on-life.md","_source":"content","_file":"blog/something-on-life.md","_stem":"blog/something-on-life","_extension":"md"}