{"_path":"/blog/unsettling-dream","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Unsettling Dream","description":" My last few weeks have been reviving and\ninsightful. After almost 2 years, I returned to my home and met old friends\nand family. I don’t know why, but whenever I think of them, it seems as if I\nam looking at the other side of the coin. The side which I have been\nneglecting, the side which somehow exists to keep me reminded of my roots. The\nside, I am trying hard to polish and shin.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-728648317398414778","slug":"unsettling-dream","publishedDate":"2011-06-25T12:05:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{"myself":"","rambling":"","with":""},"children":[]},{"type":"text","value":" My last few weeks have been reviving and\ninsightful. After almost 2 years, I returned to my home and met old friends\nand family. I don’t know why, but whenever I think of them, it seems as if I\nam looking at the other side of the coin. The side which I have been\nneglecting, the side which somehow exists to keep me reminded of my roots. The\nside, I am trying hard to polish and shin."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While I was with my family and friends, I kept asking myself why I didn’t\nsettle for a normal job and lived like everyone else. What is it that I am\npursuing in this life? Everyone seems to be going through some phase of\ntransition, and I found myself utterly confused and stunned. To make best of\nmy time, I went on a trip with my friends to see if I could find consolation\nwith my questions. But I didn’t. By the time I had to return, I had more\nquestions than before. The unsettling dream kept haunting me."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"[![]("},{"type":"element","tag":"a","props":{"href":"http://images.worldgallery.co.uk/i/prints/rw/lg/7/3/Maxi-Posters-Buddha","rel":["nofollow"]},"children":[{"type":"text","value":"http://images.worldgallery.co.uk/i/prints/rw/lg/7/3/Maxi-Posters-Buddha"}]},{"type":"text","value":"\n---Face-73632.jpg)]("},{"type":"element","tag":"a","props":{"href":"http://images.worldgallery.co.uk/i/prints/rw/lg/7/3/Maxi-","rel":["nofollow"]},"children":[{"type":"text","value":"http://images.worldgallery.co.uk/i/prints/rw/lg/7/3/Maxi-"}]},{"type":"text","value":"\nPosters-Buddha---Face-73632.jpg)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entrepreneurship is a hard choice because you are on your own, figuring out\nthe rules of life. There is no syllabus or any course work to guide you. No\nbooks that can give you enough idea about life. Moreover, there are no marks\nto grade your performance. You just have to figure out by playing it and\nthat’s it. May be its ignorance within me that prompted me to go this way, but\nI could not go any way either. Honestly, I had no idea of what\nentrepreneurship or leadership is all about, until I started playing the game,\nthe only game which made sense for me to play. The idea was not to win the\ngame, but to play and figure out the rules as I go along. For last 3 years, I\nhave figured out enough rules to make some sense of life. But sometime,\ncertain unexpected moves keep proving me wrong."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There is a saying that a “filled cup can never be filled”, and that “a rolling\nstone will never gather any moss.” But my cup never gets filled. Every time I\nlook into my cup, I see it empty. Looks like, nothing stays in my cup beside\nthe left over impressions and stains from unproven facts. On the hand, I see\nno reason why a stone should gather any moss, rather than rolling and being\nalways in motion. At the end, may be rolling stone would not gather any moss,\nbut you will find the stone beaming with perfection of its roundness which is\nabsent in the other stone. This sense reminds me of a story from Hermann\nHesse, “Siddhartha”. A young man in search of truth, who ends up finding the\nanswer late in his life, similar to the character in the movie, Into the wild."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I have been blogging with all my passion to keep reminding why I started it\nall - for the love of the life and my unsettling dream. The dream is to be\nable to architect my life in my own way and be able to do great things. But my\ndoubtful nature keeps challenging me of my path. I could not help noticing how\npeople fail due to lack of faith on their instinct. The pressuring nature of\nsocial casualties are powerful enough to generate fear. This fear is\ninteresting, it is the core of what makes you what you are. If you have read\nenough of J Krishnamurti‘s books than you will find that his main stress is\nalways in removing this fear from oneself. The fear weakens your senses to\njudge and to make right decision. I have tried hard enough to ignore my fear\nand move, but sometime I falter on my own reasoning, the only thing that I\ntrust."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Both side of the coin adds value to life. Dream and Reality are two different\nperceptions of life and balancing your way through it, is all one needs to do.\nBut the act of balance is much more complicated than it sounds and one needs\nto figure it out. It’s always the fear that plays against your balance. I\nthink, if one can control it, there should be no problem."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:unsettling-dream.md","_source":"content","_file":"blog/unsettling-dream.md","_stem":"blog/unsettling-dream","_extension":"md"}