{"_path":"/blog/choice-to-be-made","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Choice to be made.","description":"So far so good. Its been some time, where I have been pondering upon what to\nwrite about. Should I use some marketing brains to choose a perfect topic and\njust throw it in or just be me. Its time to make a choice here and its not\ngoing to be so easy. Therefore, I am not going to make any choice here. Let me\nthink more on it.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-6907091504316312921","slug":"choice-to-be-made","publishedDate":"2008-12-15T23:03:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So far so good. Its been some time, where I have been pondering upon what to\nwrite about. Should I use some marketing brains to choose a perfect topic and\njust throw it in or just be me. Its time to make a choice here and its not\ngoing to be so easy. Therefore, I am not going to make any choice here. Let me\nthink more on it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Starting from the experience so far, I have found some things regarding the\nInternet media that I want to share:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"1. Blog is not Wiki : No matter how much you try, blog can never be wiki\nbecause wikipedia already exist and there's no reason to copy it. Blog is a\nplace to share your views with people around the globe who understand what you\nare talking about. You can't talk about marketing with a guy from literature,\nright."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"2. Social Networking, a place to Advertise: So far, I had used social site\nlike: "},{"type":"element","tag":"a","props":{"href":"http://www.hi5.com/","rel":["nofollow"]},"children":[{"type":"text","value":"hi5"}]},{"type":"text","value":" and "},{"type":"element","tag":"a","props":{"href":"http://www.facebook.com/","rel":["nofollow"]},"children":[{"type":"text","value":"facebook"}]},{"type":"text","value":" to\nconnect to old lost friends and communicate with them. But recently, I find\nmyself adding anyone in my friend list and updating my status with new posts,\nso that people will read what I have been writing. This brings me to another\nphenomenon that occurred recently with a friend of mine, Bhupendra, his\nsuccess in twitter was remarkable and a interesting. [Check it\nout.]("},{"type":"element","tag":"a","props":{"href":"http://analyticsbhups.blogspot.com/2008/12/twitter-tricks-","rel":["nofollow"]},"children":[{"type":"text","value":"http://analyticsbhups.blogspot.com/2008/12/twitter-tricks-"}]},{"type":"text","value":"\ngetting-500-followers-in.html)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"3. Obsession with the updating status: This one is the remarkable phenomenon\nthat has occurred in the Internet. Today, people over the Internet are looking\nat each others profile, adding as a friend and making new connections. But\nthis small section where you update your status, as if you are some machine is\ninteresting. This demonstrates how expressive humans are, it also explains so\nmany facial expressions that we can give. Also, its a great way to start a\nconversation. For example: If you meet someone, who doesn't show any\nexpression, it difficult breaking the ice. But lets say, you meet someone who\nis happy, or sad or anything, you can at least ask the reason for it and there\nis goes, you are friends."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"4. Twitter gives you the latest news: Unarguable, not only twitter but, these\ndays, you don't have to log on to news site to get an update on the news. You\njust have to connect to your social network site and there you go, everyone is\nalready talking about it. Its so similar to the physical world."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"5. People's changing attitude towards information: All this points to one\nthings and its people's attitude towards the information. People have become\nobsessive about it, they want more and more in less time, in small packets\nwhere they don't want to chew but just swallow. Its this behaviour that is new\nin human race, its this attitude that has some how created more opportunities\nin market and also somehow caused the real in depth news to lose its\nattention."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So, these are few of my observation and analysis. Well, as I said earlier, it\nhas been some time ,I have not written but the fact is I did write, only\nthings is it didn't sound correct to post it. Its better to be true to\nyourself and write that way, its better."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:choice-to-be-made.md","_source":"content","_file":"blog/choice-to-be-made.md","_stem":"blog/choice-to-be-made","_extension":"md"}