{"_path":"/blog/purposefulness-of-idea","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Purposefulness of Idea","description":"","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-4295673656425601108","slug":"purposefulness-of-idea","publishedDate":"2015-01-13T04:43:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://4.bp.blogspot.com/-1XKTf0YUy5s/VLTdix0pQUI/AAAAAAAABes/P64g4Y2Pzcw/s1600/purposefulness_of_idea.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://4.bp.blogspot.com/-1XKTf0YUy5s/VLTdix0pQUI/AAAAAAAABes/P64g4Y2Pzcw/s1600/purposefulness_of_idea.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Yes, its been a very long time since I have posted anything. And it all boils\ndown to the \"purposefulness of idea\". I have not been able to publish anything\nbecause I am not able to find its purpose, its relevance and its place. For me\nblogging is more about a conversation and nothing more. And I have not been\nable to put up with it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This is an age of \"war of words\", where you hardly find any conversations.\nInstead, we come across opinionated arguments about right and wrong. I fail to\nsee the significance of being right and wrong and having an opinion at all.\nSimply because, it doesn't matter. My opinion about this world is not going to\nchange anything, unless I do something about it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"An idea is like a pending task waiting to be assigned to someone who is\nresponsible enough to execute it. Hence the purposefulness of an idea is\nrealised when someone decides to do something about it. Most of us are\npossessive about our ideas, a result of our false assumption that we own them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No one owns an idea. It has a life of their own. Like a living organisms, it\nstrives to exist and spread from one conscious being to another. A truly great\nidea is infectious. “Eureka!!! I have got it” is one of the expressions used\nwhen one gets infected by it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lets imagine a place, where all the great ideas are locked in. And you get to\ndive into it. What do you think will happen? Do you think you will be able to\nhandle it? A single wonderful idea has the power to carry you to the world of\necstasy. Hundreds of them would certainly make you unconscious."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So, have I found the purposefulness of an idea? No I have not. But I have\nneither found the purpose of not expressing them. Noting down every single\nhint of great ideas into a notepad and locking them in a personal vault is an\nexhaustive task. But writing about it and letting it go is more satisfying. It\nwill at least let the idea find its right destination."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:purposefulness-of-idea.md","_source":"content","_file":"blog/purposefulness-of-idea.md","_stem":"blog/purposefulness-of-idea","_extension":"md"}