{"_path":"/blog/is-design-the-result-of-frustration","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Is Design the result of Frustration?","description":"Design is a complex thing to define and further designer is a difficult thing\nto figure out. What you call design may not be a design at all. Moreover, it\nis very difficult to make out even if there has been any designing.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-1184843694113858956","slug":"is-design-the-result-of-frustration","publishedDate":"2010-09-12T11:50:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Design is a complex thing to define and further designer is a difficult thing\nto figure out. What you call design may not be a design at all. Moreover, it\nis very difficult to make out even if there has been any designing."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I have been trying to look into myself for answers and figure out what is it\nthat makes me think that something is a design. I have been a passionate\nobserver of design since my childhood, and I have promised myself to follow it\ntill the end."}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://www.georgebuehler.com/georgeimages/Thinking.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://www.georgebuehler.com/georgeimages/Thinking.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Source:georgebuehler.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nRecently, I have found that Design could be a result of a frustration. An\nimmense urge to act so that the frustration could be pacified. It is similar\nto problem solving."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In one of the interview, Richard Feynman (physicist) said that problem solving\nis an act of getting rid of frustration."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"He gave a good example of a monkey trying to reach out to the tree for the\nfruit. But the monkey could not reach out, so out of immense frustration, he\ngrabs one of the stick and tries to shake the branch of the tree. This act is\nin it-self is a first act of solving a problem. In other sense, it could be a\nfirst act to design something to solve a problem."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Have you ever notice that all the scientific theories are born out of problem\nand not through the need of scientist to express. But on the other hand, every\nform of art like music, painting, writing has come out of need of artist to\nexpress. You can always find a trait or style in an artist, but you rarely\nfind traits in scientist. The approach of scientist could be different but the\nsolution always turns out to be independent of the style."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Therefore, every design is always trying to solve a problem. If it is not than\nI am sorry but its not a design. I would rather call that an art. Now this is\na very controversial for me to be removing design from art. But seriously, I\ndo not think art has anything to do with design. Every art is not a design,\nbut all good design could be taken as an Art."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Art is always a result of self expression, an act to express your idea and\nthoughts and give them a form. Form could be writing, painting, music,\nblogging etc. But in the whole process of art, you are always dealing with\nyour feelings and your identity. Your culture, your past and your values come\nout expressively through art, but not in a design. Though I could have some\ninner conflict with this idea, nevertheless I can live with it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But a design and art could be fused together as well if necessary. For\nexample, a sofa or a chair could be designed perfectly with a touch of art.\nMany would try to defend their artistic side to their design but I think it is\nup to the designer to decide what experience he wants to express, that is if\nhe wants to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the same line, I would want to share something that Bruce Lee told in his\nrare interview. We all know that his way of fighting was precise and powerful.\nHe said that when he wants to punch someone, he could display complex movement\n(like traditional Chinese Kong-Fu ). But he said that it was inefficient,\ninstead he would focus all his energy in delivering a powerful punch. So we\ncan argue that his way of fighting was not a art but a resolution to a problem"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"a problem of either truly defending yourself or attacking your opponent.\nSimilarly traditional Chinese Kong-Fu can be taken as an art of expressing\nyour body's strength and following a discipline."}]}]},{"type":"element","tag":"h2","props":{"id":"_1"},"children":[{"type":"element","tag":"a","props":{"href":"http://www.cluelessdesigns.com/CD%20Website/assets/thinker.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://www.cluelessdesigns.com/CD%20Website/assets/thinker.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Source:cluelessdesigns.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nArt always has rules(discipline) that you are not suppose to break. But not\ndesign. Design can be as revolutionary as possible coming out of nowhere and\nno relevance to past or present. Art can be priceless, but design always comes\nwith a price of performance. You cannot compare arts, but surely you can\ncompare design."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Remember that I am not arguing based on traditional definition of design and\nart. I am just using the words to identify certain form of process which we\nsee day to day. I am not even trying to define art or design. I wish I could\nuse any arbitrary term to describe what I am trying to but that would make no\nsense."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So yes, I think that design is a result of pure frustration of seeing\nsomething not work the way it should. Also art is always governed by an ego of\nan artist and it's existence are never questioned or justified. But a design\nis always governed by a problem and not by designer, hence they always need\njustification. Sometime mixing these two in your work could lead to disaster."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So when ever I see any form of so-called design, I like to ask 3 questions:"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\n1. Does this solve any problem?"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\n2. Is the decision made by Designer encouraged by the problem?"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\n3. Do you see any sense of brand in the design?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I find the third question important to ask because most of the time, design\nbecomes a style statement rather than being a true design. In such cases,\ndesigner is evolved in justifying himself rather than a design. Because when a\ndesign comes from a pure frustration, problem drives every aspect of design."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Well, I think I should end my monologue here for now and keep my mind to rest\nfor a while :)."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"","depth":2,"text":""},{"id":"_1","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:is-design-the-result-of-frustration.md","_source":"content","_file":"blog/is-design-the-result-of-frustration.md","_stem":"blog/is-design-the-result-of-frustration","_extension":"md"}