{"_path":"/blog/act-of-priority-shifting","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Act of Priority Shifting","description":"While I was back in Nepal, I met a very dear friend of mine after a pretty\ndarn long time. She came to visit me at my house and we had great time\nchatting about old days. During our chat, I asked her if we should plan for\nsomething coming this week. She pulled a tattered sheet of torn paper where\nshe had meticulously drawn a calendar with each box containing her schedules.\nI was impressed and embarked upon making my own sheet. We made a plan for\nThursday get together with other friends. I marked in a big letters under my\nThursday box. “5:00 pm Meet Up”","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-6618192155768058630","slug":"act-of-priority-shifting","publishedDate":"2011-08-18T00:50:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"While I was back in Nepal, I met a very dear friend of mine after a pretty\ndarn long time. She came to visit me at my house and we had great time\nchatting about old days. During our chat, I asked her if we should plan for\nsomething coming this week. She pulled a tattered sheet of torn paper where\nshe had meticulously drawn a calendar with each box containing her schedules.\nI was impressed and embarked upon making my own sheet. We made a plan for\nThursday get together with other friends. I marked in a big letters under my\nThursday box. “5:00 pm Meet Up”"}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://1.bp.blogspot.com/-NSnRV2rEnUw/Tky_cbNpiAI/AAAAAAAAA8g/qYKsHBgIjKw/s1600/Favim.com-20045_thumb.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://1.bp.blogspot.com/-NSnRV2rEnUw/Tky_cbNpiAI/AAAAAAAAA8g/qYKsHBgIjKw/s1600/Favim.com-20045_thumb.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Source : whicdn.com"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nThere is always some sense of gratification in planning which is interesting\nto ponder upon. Laying out agendas, road-maps and schedules are time consuming\nand interesting, only to realize the hard rules of priority shifting. Now I\nwas home after a long time and that also only for 20 days, so I had simple\nagenda but no plan (Don’t confuse PLAN with AGENDA. It’s the same confusion\nbetween IDEA and EXECUTION). Some of the most important were: Being At home,\nhanging out with Friends, Taking a Road Trip and meeting some folks according\nto priority."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Well, THURSDAY 5:00 PM Meet Up never happened and we had to squeeze last 5/10\nminutes to make ourselves available before I left Nepal (This happened at the\nnick of time with delicate time sharing and priority shifting – a common term\nin design of Operating System :)). So what happened to all that planning and\nscheduling? Did the earth change its direction? :) Well, no but what did\nchange was priority. That happens often in life, priority changes with time\nand situation. And the whole act of balancing your way means everything. At\nthe end of 20 days, I had all my agenda ticked mark, with few missed task\n(Remember this, got my agenda fulfilled but missed some task)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now that demonstrates 20 days demo of your life. Life is often taken as long\njourney which I think is an illusion. Your long one year journey is just a dot\nin your entire life. Now how important you want to make that dot depends upon\nyou. If you are skilful you might just be able to stretch that dot into a\nline. (This comes from my ongoing exploration about time independent theory of\naging. Which I am planning to write when I get it right:)) Just like 20 days,\nlife is short with all your agendas and priorities mixed. At the end of your\nlife, I think you find yourself staring at a list of agendas with Green Tick\nand Red Cross marks all over it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Even after that short 20 days, my days are still on turmoil with priority\nshifting. Being an entrepreneur, you have to be able to shift gears and change\nat nick of time. I have stopped counting how many times, I have made those\ntight turns. Shifting is very important activity because shifting allows you\nto align yourself to your agenda. If you miss the shift, you end of losing one\nagenda from your list :) unless you find other turn and time to re-align\nyourself. Beside the illusion that there are ample opportunities, I try not to\nget overwhelmed by it. You just keep hitting and missing things, sometime you\nare glad you missed and sometime you are not."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I have a belief that it’s always easy to make the most important decisions of\nyour life, but really difficult to make less important decisions. The catch is\nhow do you know what is important and what is not. The goal of PLANNING is not\nto get the AGENDA right, but to get the processes aligned and executed\nproperly. Planning is process dependent activity where you are not concerned\nabout the agenda but only with processes and minute details of activities and\ngetting them right. Hence, there is a thin line between PLAN and AGENDA, which\nties them together and is a pretty difficult task to figure that out."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One of my artist friend had told me long time back that getting the right\ncomposition in your painting or photography is very important than getting the\nlines or circles or focus correct. And knowing or identifying good composition\nis a lifelong activity and realization, never ending. Getting right focus or\nstraight lines are like getting things planned out. You will have to use right\nlenses and right brush strokes to get your content right. You may get a\nbeautiful picture or painting if you have right plan, but the hard fact behind\nthe art which is composition is not dependent upon your plan. It has nothing\nto do with the quality of your image or quality of your brush strokes or\nfocus."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"That is why it’s so difficult to understand the link between agenda and plan,\nor idea or execution because those underlining concept are hidden and\nmysterious, making the both end tied with random rules (also popularly\nexpressed as rules of god :)). This is much more complicated than wave-\nparticle duality which consists of only 2 states; here we are talking about\nmultiple instances with different form and factor. Welcome to string theory,\nwhere these multiple instances are expressed as a form of energy vibrating at\ndifferent frequency. Not a discrete state of particle or wave, but entirely\nspread over concept of continuum variable. Sorry for diverting but I had to\nmake a shift to demonstrate just how important it is to understand the\ncomplication with getting things right."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Therefore, the act of priority shifting is the closest think (I assume) that\ncan come to realizing your agenda or that can come to realizing your\ncomposition or that come to realizing your idea take form and shape the way\nyou visualized. But off course, priority shifting always comes with a price of\nchanging your plan. You won’t get it right the first time as I told you\nearlier; the missing link has mysterious nature. That is also why, recently a\npopular theory on Failure has been appearing in every innovation blogs because\nthe closest to getting things right is to try it out."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:act-of-priority-shifting.md","_source":"content","_file":"blog/act-of-priority-shifting.md","_stem":"blog/act-of-priority-shifting","_extension":"md"}