{"_path":"/blog/democratic-voting-a-failed-system","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Democratic Voting a Failed System?","description":"The Democratic Voting is a statistical fallacy. Why? Let me come to my point,\nwhy is the concept that majority wins followed everywhere. Where in the\nstatistic does it tell that the majority is always the correct. According to\nmathematics, majority only shows the likeliness of the people to choose that\nparticular person. But nowhere does it say that it is the correct one.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-1493136958911565219","slug":"democratic-voting-a-failed-system","publishedDate":"2008-12-07T11:25:00.001-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Democratic Voting is a statistical fallacy. Why? Let me come to my point,\nwhy is the concept that majority wins followed everywhere. Where in the\nstatistic does it tell that the majority is always the correct. According to\nmathematics, majority only shows the likeliness of the people to choose that\nparticular person. But nowhere does it say that it is the correct one."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Therefore, should majority be followed even if it is known that the choice is\nWRONG. What is the justification for it? Or has anyone even tried to justify\nit? Is this the natural law that must be followed blindly?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"History have shown us how a single person have fought against the majority.\nStarting from all the scientists to leaders. Should the truth always remain\nfighting against the majority. Is that how it is, and should be? Can't we\nadapt our senses to bring the right choice rather than a major choices?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"May be its the survival of the fittest, where the more stronger in number\nalways wins. Right choice are always smudged by the majority. Every year we\nsee the election process go on and on , and the mistakes seem to repeat\nitself. Very rarely does it happen that the right choices are made and even\nthat happen as an alternative choice or a choice due to helplessness."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Most people can't differentiate between right and wrong. Haven't we learnt\nenough from the reality TV shows where the winner is not always the best.\nIsn't that the most visible truth of why majority or democratic voting fails."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Further democratic voting is never so democratic. Democratic means decision\nmade from unbiased analysis. Do you think that happens? Often people make\ndecision based upon others choice and not their own. They feel insecure doing\nfree thinking."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Thus I say Democratic Voting is a failed system. We need something else to\ndetermine not the popular choice but the right choice."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:democratic-voting-a-failed-system.md","_source":"content","_file":"blog/democratic-voting-a-failed-system.md","_stem":"blog/democratic-voting-a-failed-system","_extension":"md"}