{"_path":"/blog/teaching-i","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Teaching I","description":"[![](http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-QZzI/AAAAAAAAAF8/_Aw22wd-\n_xg/s400/teaching.jpg)](http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-\nQZzI/AAAAAAAAAF8/_Aw22wd-_xg/s1600-h/teaching.jpg)","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-7574794314686121390","slug":"teaching-i","publishedDate":"2008-10-11T03:14:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"[![]("},{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-QZzI/AAAAAAAAAF8/_Aw22wd-","rel":["nofollow"]},"children":[{"type":"text","value":"http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-QZzI/AAAAAAAAAF8/_Aw22wd-"}]},{"type":"text","value":"\n_xg/s400/teaching.jpg)]("},{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-","rel":["nofollow"]},"children":[{"type":"text","value":"http://3.bp.blogspot.com/_UYUaEitRq54/SPCFkD-"}]},{"type":"text","value":"\nQZzI/AAAAAAAAAF8/_Aw22wd-_xg/s1600-h/teaching.jpg)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Its almost been 3/4 years that I started to teach "},{"type":"element","tag":"a","props":{"href":"http://en.wikipedia.org/wiki/Advanced_Level_(UK)","rel":["nofollow"]},"children":[{"type":"text","value":"A Level\nPhysics"}]},{"type":"text","value":". I started with a\nreason to share all the things that I had learnt during my "},{"type":"element","tag":"a","props":{"href":"http://en.wikipedia.org/wiki/Advanced_Level_(UK)","rel":["nofollow"]},"children":[{"type":"text","value":"A\nlevel"}]},{"type":"text","value":" days. That seemed\nmore convincing to me for doing so. But I had to manage time for my own\nstudies, as well. For the third person, it looked as if I was walking on two\nseparate roads. But from my perspective, I saw that the path was one and only\none."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I kept studying my engineering courses and preparing lectures. But it did not\nhappen the way it usually does. Mostly, preparing a lecture would mean holding\na pen and paper and listing the points to be taught. It might sound stupid and\nodd but my most lectures were prepared on my mind. I usually prepared my\nclass, as I was cycling to campus, or sometime while listening to music and\nmost of the time while day dreaming. It is really odd thing to say but it was\nusually this way, that I learnt to teach. If I had gone the other way, by\nlooking at the books an preparing a note then I would have never been able to\ntell the students what I really wanted to. I always thought that teachers are\nthere to tell you things that are not written on books."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Its usually my experience with education that I have never and ever reviewed\nmy lecture note once it was written. Somehow the whole process of writing note\nseemed more important to me then going through it afterwards. Therefore, I\nusually encouraged my student to write on their own, instead on what teachers\nwere telling. But for many reasons the techniques wasn't working. Most of the\ntime, student rarely made their own notes which terribly upset me, for the\nonly reason that they were missing the skills to write down what they knew and\nthat they were being incapable of sharing their knowledge. The knowledge that\nisn't shared loses its reason of existence."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During my years of teaching, I always forced myself to be stubborn about not\ngiving any notes to the student. But now and then I would receive complains\nfrom them, as the exam came nearer and they didn't have anywhere to refer. I\nwould get really frustrated. But then with patience, I would note down the\nimportant points for their shake. Some how I hated myself for spoon feeding\nthem but I had to do."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Years have passed and I have all these mixed reactions with students, some\nsuccess and some failure. I would think about it a lot and see if there was a\npoint where I had gone wrong. From teachers perspective, its really difficult\nto see the failure in student, cause it would somehow reflect the failure on\nme. But I guess that was what I kept learning all these years, failure and\nsuccess hand in hand."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:teaching-i.md","_source":"content","_file":"blog/teaching-i.md","_stem":"blog/teaching-i","_extension":"md"}