{"_path":"/blog/social-media-and-artistic-integrity","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Social Media and Artistic Integrity","description":"Suddenly, I am starting to feel that there is some sense of freedom among\nartists in today’s society. This I realised after I observed the trends in\nYouTube and other social networking channels where creative people were freely\nexpressing themselves without any need of mediator.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-5550671903429984746","slug":"social-media-and-artistic-integrity","publishedDate":"2011-02-26T13:32:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suddenly, I am starting to feel that there is some sense of freedom among\nartists in today’s society. This I realised after I observed the trends in\nYouTube and other social networking channels where creative people were freely\nexpressing themselves without any need of mediator."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Artists are always known for their eccentricity and individualism. Their ego\ndefines their works of art and that is what people around love the most. But\nin between the artists and people, there were always critics and mass media\nwho defined the image of the artists. These mediators were people benefiting\nfrom the whole game. Though not all are as bad as I am making them sound :)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But the reality is that platforms and media always had a control over making\nor breaking an artist and they still do. Publishers always control the content\nof the book and records label always control the content of the music. Because\nbehind this whole setup is a big business model running. There is nothing good\nor bad about it, it’s just the way it is. But there has always been an\nindependent group of artists revolting this whole system."}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://www.informationliberation.com/files/ftnhd.JPG","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://www.informationliberation.com/files/ftnhd.JPG"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Source : informationliberation.com"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nFor example, along the line of mainstream cinema you can always find\nindependent films breaking the norms of main stream culture and similarly\ngarage bands breaking the trends of posed culture by main line music industry.\nBut look around you today, you will find that nothing can stop these artists\nfrom reaching out to people."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are free platforms for people to share their creativity and earn from\nthem. Hence I feel that power to control the creative work is going back to\nthe creator rather than to distributors. But it’s not that there was never any\nfreedom before. But it took a lot of effort for creators to control their\nwork."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Recently, Paulo Coelho, author of alchemist, told in his interview that he\nsold his recent books all through twitter and facebook and without any kind of\npromotional activities in main media. I think that is very encouraging for\nartists. Also youtube is full of self made artist doing great in their walk of\nlife. This proves that a true and genuine artist always have a place in the\nworld."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But why did I put the title as Social Media and Integrity? Well integrity is\nsomething that is very much the only assets of artists, as far as I am\nconcerned. So I believe that social media is giving people to think freely and\nexpress in any way they like, irrespective of what others have to say. Hence\npreserving their integrity."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:social-media-and-artistic-integrity.md","_source":"content","_file":"blog/social-media-and-artistic-integrity.md","_stem":"blog/social-media-and-artistic-integrity","_extension":"md"}