{"_path":"/blog/opportunities-and-success","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Opportunities and Success","description":"Just before sleeping I decided to go through the first chapter of Outliers,\none of the bestselling book on success and innovation. The chapter was so\nintriguing that it pushed me to think hard about myself. And I had only begun\nto read.","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-2906355216936107501","slug":"opportunities-and-success","publishedDate":"2010-11-10T14:03:00.000-08:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just before sleeping I decided to go through the first chapter of Outliers,\none of the bestselling book on success and innovation. The chapter was so\nintriguing that it pushed me to think hard about myself. And I had only begun\nto read."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A very valid point was made in the chapter about the opportunities that people\nget in their life which pushes them to success and how baise these\nopportunities tend to be. A very intriguing example was given of how a hockey\nplayers in a specific region turned out to have similar birth months. No, it\nhad nothing to do with astrology but a simple set of opportunities set out by\nthe council of hockey which gave more opportunities to the people born in\nJanuary, February and March."}]},{"type":"element","tag":"h2","props":{"id":"httpwwwstrongodorscomwp-contentuploads201001legosjpghttpwwwstrongodorscomwp-contentuploads201001legosjpg"},"children":[{"type":"text","value":"[![]("},{"type":"element","tag":"a","props":{"href":"http://www.strongodors.com/wp-","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.strongodors.com/wp-"}]},{"type":"text","value":"\ncontent/uploads/2010/01/legos.jpg)]("},{"type":"element","tag":"a","props":{"href":"http://www.strongodors.com/wp-","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.strongodors.com/wp-"}]},{"type":"text","value":"\ncontent/uploads/2010/01/legos.jpg)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"strongodors.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nIt turned out that the council enrolled young kids for training at specific\ntime which unknowingly gave kids born in January more chances of fitting the\nage bar and entering the hockey team."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As a result, these kids got head start in their life and rode on the\nopportunities towards success."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though, it is not ignoring skills and intelligence. It surely points out the\nmissed opportunities for other kids. In the chapter, more examples are given\nfor different games, education and different scenarios."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And seriously, we have witnessed these facts even in our day to day life. We\nfind people with opportunities more equipped with things to handle the day to\nday challenges. And I looked at myself and said, \"What opportunities did I\nhave and what I didn't?\""}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To start with, I was born in a city which gave me excess to advantages of city\ndwellers. But ironically, I spent most of my childhood in a small village, on\neastern part of Nepal, which was a base for advance research on Agriculture\n(PAC), where my father was working."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though, I did my early schooling in a village school which had less to offer\nthan city school. The place I was living in was nothing like a village. It was\na merge of high end research labs and villagers living in harmony. The people\nand the culture of the place is still something I idealized."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It was in this very village I had witnessed computers and large computer\nnetworks, despite the fact that the village had no telephone for inter\ncommunication. Amazingly, though the time was between 80s and 90s, I was able\nto see and experience Laptops before Desktops. I still find it strange because\nit was only after a decade I was able to own my own Desktop while I was doing\nmy A level. Here I have given you an example of few gained and missed\nopportunities, based on location. But I have noticed that location sometime\ndoes not bother people who have strong will to succeed."}]},{"type":"element","tag":"h2","props":{"id":""},"children":[{"type":"element","tag":"a","props":{"href":"http://farm4.static.flickr.com/3146/2821703758_19f59b9ff9.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://farm4.static.flickr.com/3146/2821703758_19f59b9ff9.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"flickr.com"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nNow lets go to parenting. Today I have an engineering degree and a passion for\nbuilding things and making it work."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This passion was seeded into me early on when my father gave me a LEGO as a\nfirst toy. I still remember the day he opened the box and gave me the pieces\nto solve. Since then I have never stopped dreaming about building and\ndesigning systems and working with it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But my main point is that I did not become an engineer because I was given a\nLEGO and that I had fun with it in my early days. The important thing is that\nI was given an opportunity to explore things which luckily resonated with my\ninterest and skill sets. "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"(Because I still remember my father buying me a\nGeneral Knowledge book on which I simply had no interest :) )"}]},{"type":"text","value":" I was even\nlucky to have an uncle who was amazingly creative and inspired me to draw,\nbuild and even play music. Somehow, I still have a taste for music similar to\nhim. This doesn't mean I was influenced, it means that I was lucky to have\npeople around me with whom I could resonate. Now that is very important. I\nbelieve that every people have something interesting inside them and that they\nshould get an opportunity to explore it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now, this opportunities to explore your interest is much more important than\nan opportunity to go into formal schooling and get a degree. Because once a\nkid finds his passion, he is bound to follow it till the end and success in\nitself is defined by his path. But in this weak education system, modern\nschools have a habit of narrowing down your options. I still remember how the\namount of Art and Music class lessened as we marched to higher grade."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My point is that though opportunities play important roles in people's life\nsometime a little more hard work can balance the missed opportunities. Because\nlooking at myself, I know that there were many points where I could not\nachieve certain things due to the lack of opportunity, but as time went on the\nhomework paid off. My experience shows that when you realize that you are not\nable to do certain things better than other due to lack of knowledge, just\nremove your self from the rat race of trying to win. Step aside and work on\nyour weakness and do a strong homework."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I could go on and on. But I thing thats enough. Further I do not know how the\nbook will move forward and may be there are certain things that I still have\nnot explored in this post. But when I get time, I will certainly do so. Also,\nfeel free to share your thoughts on it."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"httpwwwstrongodorscomwp-contentuploads201001legosjpghttpwwwstrongodorscomwp-contentuploads201001legosjpg","depth":2,"text":"[![](http://www.strongodors.com/wp-\ncontent/uploads/2010/01/legos.jpg)](http://www.strongodors.com/wp-\ncontent/uploads/2010/01/legos.jpg)"},{"id":"","depth":2,"text":""}]}},"_type":"markdown","_id":"content:blog:opportunities-and-success.md","_source":"content","_file":"blog/opportunities-and-success.md","_stem":"blog/opportunities-and-success","_extension":"md"}