{"_path":"/blog/space-exploration","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Space Exploration","description":"","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-8597741469640968892","slug":"space-exploration","publishedDate":"2008-09-13T23:17:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://3.bp.blogspot.com/_UYUaEitRq54/SMytBxBt7OI/AAAAAAAAABs/7cBE2UlVweU/s1600-h/312061.JPG","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"http://3.bp.blogspot.com/_UYUaEitRq54/SMytBxBt7OI/AAAAAAAAABs/7cBE2UlVweU/s400/312061.JPG"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Great piece of engineering! How many years did it take for us to reach here.\nBut there is one question that everyone is asking. \"Is it worth spending so\nmuch on it?\" I don't know how much does it cost? Pretty lot. So....should we\nstop? Hmmm."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Imgaine yourself, one fine morning you wake up and find yourself in a deserted\nisland. You look everywhere and you can't find anything that looks like you.\nRemember Tom Hanks in Cast Away. Well yup pretty much like it. What would you\ndo?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"First you would see if there is any one. Not finding anyone, you would slowly\ntry to survive in the environment and you may live or die. If you die its the\nend. But if you are alive what would you do next? Explore! you would explore\nunless you are lazy. And believe me some people are so lazy that they have\nlost their human instinct. Now that is the correct word \"INSTINCT\"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After much time, you would also start to wonder about life and question your\nexistence. When you finally think its time to put yourself on the captains\nseat and explore, you would."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And there are few who can take these initiatives. So in a bigger picture what\nwe are doing by spending money in Space Exploration is that we are following\nour instinct. We are searching for a reason of our existence and it is very\nimportant for us to do so. For us to know that we are doing something about\nit. Though yes, the whole thing might have been started due to the cold war or\nthe warm war. It makes sense to me to try and explore."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Yes, we may be wasting a lot of capital but can we stop ourselves from not\ntring to know our origin. Do we still have space in us for these kinds of\nquestions or have we lost all our enthusiasm in it. I don't want to argue if\nit is right or wrong to do so, simply because I can't justify neither."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But I can assure you that once you stop searching, you are sure to find\nyourself in a BIG deadlock in your life."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:space-exploration.md","_source":"content","_file":"blog/space-exploration.md","_stem":"blog/space-exploration","_extension":"md"}