{"_path":"/blog/sustainable-community-and-the-reality-show-format","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Sustainable community and the reality show Format","description":"So here is the idea which I have been pondering among, \" how to build a\nsustainable community?\" An important question, I suppose for all the\ndeveloping and under developing nations. But this is a question not only among\nthe nation builders but also among brands. Today, brands are competing head on\nto build a community around its services and products. So what is the right\nway?","postId":"tag:blogger.com,1999:blog-8061911113731935185.post-1837709059232034016","slug":"sustainable-community-and-the-reality-show-format","publishedDate":"2012-07-19T08:13:00.000-07:00","layout":"post","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So here is the idea which I have been pondering among, \" how to build a\nsustainable community?\" An important question, I suppose for all the\ndeveloping and under developing nations. But this is a question not only among\nthe nation builders but also among brands. Today, brands are competing head on\nto build a community around its services and products. So what is the right\nway?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I suppose there are different methods to it. For example, lets take an\nanalogy:"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lets say, I build a house, equip it with furniture and all the necessary\nresources like food and energy. Then I invite people to come to the house and\nstay over. I think it will be wrong to assume that the people will finally\nevolve into a community because this is not how a community is built. This\nparticular format is more like a Reality TV show format, and we all know that\nthis format is not designed to be sustainable but to collapse with time.\nBecause in Reality TV show format, rather than building a community, it\ndisintegrates into one single member - who will be the winner."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Community is mostly build out of necessity. It starts with few people, there\nis a reason and context behind their meet, then they communicate, collaborate\nand create. As a result, they build their surrounding to suit their needs and\nhence we have a community. This community is more sustainable."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So what is my point? My point is that instead of investing in infrastructure\nand resources, the first thing that any community or nation builders must\ninvest is on PEOPLE. Cause investing in people will empower people who will\nthen there by communicate, collaborate and create."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Its like game of life. Currently, there are millions of small communities\ncompeting to exist and sustain the changes. Few will raise and fall, few will\nremain unheard but some will leave a legacy. Community doesn't have to die,\nbut they surely change with time."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:sustainable-community-and-the-reality-show-format.md","_source":"content","_file":"blog/sustainable-community-and-the-reality-show-format.md","_stem":"blog/sustainable-community-and-the-reality-show-format","_extension":"md"}