[{"data":1,"prerenderedAt":217},["ShallowReactive",2],{"content-query-IoMxHbyG24":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":211,"_id":212,"_source":213,"_file":214,"_stem":215,"_extension":216},"/blog/best-of-steve-job-from-his-1985-interview","blog",false,"","Best of Steve Job from his 1985 interview","In 1985 interview of Steve Jobs with the Playboy magazine, we can see some of\nthe early vision in regards of Apple's future and business fundamentals. This\nwas also the time when Apple had build its first MAC. Here are some of the\nmost inspiring statements from him:","tag:blogger.com,1999:blog-8061911113731935185.post-8632226108410276262","best-of-steve-job-from-his-1985-interview","2010-11-21T11:40:00.000-08:00","post",{"type":15,"children":16,"toc":206},"root",[17,24,39,56,65,74,84,95,104,109,118,127,147,156,161,170,175,181,194],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":25,"props":26,"children":27},"h2",{"id":7},[28],{"type":18,"tag":29,"props":30,"children":34},"a",{"href":31,"rel":32},"http://www.theapplecollection.com/various/Celebrity/images/think_different.jpg",[33],"nofollow",[35],{"type":18,"tag":36,"props":37,"children":38},"img",{"alt":7,"src":31},[],{"type":18,"tag":19,"props":40,"children":41},{},[42,44,48,54],{"type":23,"value":43},"Source : theapplecollection.com",{"type":18,"tag":45,"props":46,"children":47},"br",{},[],{"type":18,"tag":49,"props":50,"children":51},"strong",{},[52],{"type":23,"value":53},"JOBS:",{"type":23,"value":55}," Companies, as they grow to become multibillion-dollar entities,\nsomehow lose their vision. They insert lots of layers of middle management\nbetween the people running the company and the people doing the work. They no\nlonger have an inherent feel or a passion about the products. The creative\npeople, who are the ones who care passionately, have to persuade five layers\nof management to do what they know is the right thing to do.",{"type":18,"tag":19,"props":57,"children":58},{},[59,63],{"type":18,"tag":49,"props":60,"children":61},{},[62],{"type":23,"value":53},{"type":23,"value":64}," What happens in most companies is that you don't keep great people\nunder working environments where individual accomplishment is discouraged\nrather than encouraged. The great people leave and you end up with mediocrity.\nI know, because that's how Apple was built. Apple is an Ellis Island company.\nApple is built on refugees from other companies. These are the extremely\nbright individual contributors who were troublemakers at other companies.",{"type":18,"tag":19,"props":66,"children":67},{},[68,72],{"type":18,"tag":49,"props":69,"children":70},{},[71],{"type":23,"value":53},{"type":23,"value":73}," There's an old Hindu saying that comes into my mind occasionally:\n\"For the first 30 years of your life, you make your habits. For the last 30\nyears of your life, your habits make you.\" As I'm going to be 30 in February,\nthe thought has crossed my mind.",{"type":18,"tag":19,"props":75,"children":76},{},[77,79,82],{"type":23,"value":78},"**",{"type":18,"tag":45,"props":80,"children":81},{},[],{"type":23,"value":83},"\n**",{"type":18,"tag":19,"props":85,"children":86},{},[87],{"type":18,"tag":29,"props":88,"children":91},{"href":89,"rel":90},"http://gigapple.files.wordpress.com/2010/02/jobsmotorcycle.jpg",[33],[92],{"type":18,"tag":36,"props":93,"children":94},{"alt":7,"src":89},[],{"type":18,"tag":19,"props":96,"children":97},{},[98,102],{"type":18,"tag":49,"props":99,"children":100},{},[101],{"type":23,"value":53},{"type":23,"value":103}," And I'm not sure. I'll always stay connected with Apple. I hope that\nthroughout my life I'll sort of have the thread of my life and the thread of\nApple weave in and out of each other, like a tapestry. There may be a few\nyears when I'm not there, but I'll always come back. And that's what I may try\nto do. The key thing to remember about me is that I'm still a student. I'm\nstill in boot camp. If anyone is reading any of my thoughts, I'd keep that in\nmind. Don't take it all too seriously.",{"type":18,"tag":19,"props":105,"children":106},{},[107],{"type":23,"value":108},"If you want to live your life in a creative way, as an artist, you have to not\nlook back too much. You have to be willing to take whatever you've done and\nwhoever you were and throw them away. What are we, anyway? Most of what we\nthink we are is just a collection of likes and dislikes, habits, patterns. At\nthe core of what we are is our values, and what decisions and actions we make\nreflect those values. That is why it's hard doing interviews and being\nvisible: As you are growing and changing, the more the outside world tries to\nreinforce an image of you that it thinks you are, the harder it is to continue\nto be an artist, which is why a lot of times, artists have to go, \"Bye. I have\nto go. I'm going crazy and I'm getting out of here.\" And they go and hibernate\nsomewhere. Maybe later they re-emerge a little differently.",{"type":18,"tag":19,"props":110,"children":111},{},[112,116],{"type":18,"tag":49,"props":113,"children":114},{},[115],{"type":23,"value":53},{"type":23,"value":117}," I still don't understand it. It's a large responsibility to have\nmore than you can spend in your lifetime—and I feel I have to spend it. If you\ndie, you certainly don't want to leave a large amount to your children. It\nwill just ruin their lives. And if you die without kids, it will all go to the\nGovernment. Almost everyone would think that he could invest the money back\ninto humanity in a much more astute way than the Government could. The\nchallenges are to figure out how to live with it and to reinvest it back into\nthe world, which means either giving it away or using it to express your\nconcerns or values.",{"type":18,"tag":19,"props":119,"children":120},{},[121,125],{"type":18,"tag":49,"props":122,"children":123},{},[124],{"type":23,"value":53},{"type":23,"value":126}," No. There are some simple reasons for that. One is that in order to\nlearn how to do something well, you have to fail sometimes. In order to fail,\nthere has to be a measurement system. And that's the problem with most\nphilanthropy—there's no measurement system. You give somebody some money to do\nsomething and most of the time you can really never measure whether you failed\nor succeeded in your judgment of that person or his ideas or their\nimplementation. So if you can't succeed or fail, it's really hard to get\nbetter. Also, most of the time, the people who come to you with ideas don't\nprovide the best ideas. You go seek the best ideas out, and that takes a lot\nof time.",{"type":18,"tag":19,"props":128,"children":129},{},[130,132,138,140,145],{"type":23,"value":131},"[![](",{"type":18,"tag":29,"props":133,"children":136},{"href":134,"rel":135},"http://www.cultofmac.com/wordpress/wp-",[33],[137],{"type":23,"value":134},{"type":23,"value":139},"\ncontent/uploads/2010/10/Alt_Drawing_Steve_Jobs.jpg)](",{"type":18,"tag":29,"props":141,"children":143},{"href":134,"rel":142},[33],[144],{"type":23,"value":134},{"type":23,"value":146},"\ncontent/uploads/2010/10/Alt_Drawing_Steve_Jobs.jpg)",{"type":18,"tag":19,"props":148,"children":149},{},[150,154],{"type":18,"tag":49,"props":151,"children":152},{},[153],{"type":23,"value":53},{"type":23,"value":155}," Well, my favorite things in life are books, sushi and.... My\nfavorite things in life don't cost any money. It's really clear that the most\nprecious resource we all have is time. As it is, I pay a price by not having\nmuch of a personal life. I don't have the time to pursue love affairs or to\ntour small towns in Italy and sit in cafes and eat tomato-and-mozzarella\nsalad.",{"type":18,"tag":19,"props":157,"children":158},{},[159],{"type":23,"value":160},"Occasionally, I spend a little money to save myself a hassle, which means\ntime. And that's the extent of it. I bought an apartment in New York, but it's\nbecause I love that city. I'm trying to educate myself, being from a small\ntown in California, not having grown up with the sophistication and culture of\na large city. I consider it part of my education. You know, there are many\npeople at Apple who can buy everything that they could ever possibly want and\nstill have most of their money unspent. I hate talking about this as a\nproblem; people are going to read this and think, Yeah, well, give me your\nproblem. They're going to think I'm an arrogant little asshole.",{"type":18,"tag":19,"props":162,"children":163},{},[164,168],{"type":18,"tag":49,"props":165,"children":166},{},[167],{"type":23,"value":53},{"type":23,"value":169}," The minute you have the means to take responsibility for your own\ndreams and can be held accountable for whether they come true or not, life is\na lot tougher. It's easy to have wonderful thoughts when the chance to\nimplement them is remote. When you've gotten to a place where you at least\nhave a chance of implementing your ideas, there's a lot more responsibility in\nthat.",{"type":18,"tag":19,"props":171,"children":172},{},[173],{"type":23,"value":174},"Here is another great resource about Steve Jobs Perspective.",{"type":18,"tag":25,"props":176,"children":178},{"id":177},"_john-sculley-on-steve-jobs-the-full-interview",[179],{"type":23,"value":180},"_[John Sculley On Steve Jobs, The Full Interview",{"type":18,"tag":19,"props":182,"children":183},{},[184,186,192],{"type":23,"value":185},"Transcript](",{"type":18,"tag":29,"props":187,"children":190},{"href":188,"rel":189},"http://www.cultofmac.com/john-sculley-on-steve-jobs-the-full-",[33],[191],{"type":23,"value":188},{"type":23,"value":193},"\ninterview-transcript/63295 \"Permanent Link to John Sculley On Steve Jobs, The\nFull Interview Transcript\")_",{"type":18,"tag":19,"props":195,"children":196},{},[197,199],{"type":23,"value":198},"Source : ",{"type":18,"tag":29,"props":200,"children":203},{"href":201,"rel":202},"http://tech.fortune.cnn.com/",[33],[204],{"type":23,"value":205},"tech.fortune.cnn.com",{"title":7,"searchDepth":207,"depth":207,"links":208},2,[209,210],{"id":7,"depth":207,"text":7},{"id":177,"depth":207,"text":180},"markdown","content:blog:best-of-steve-job-from-his-1985-interview.md","content","blog/best-of-steve-job-from-his-1985-interview.md","blog/best-of-steve-job-from-his-1985-interview","md",1719052049446]