[{"data":1,"prerenderedAt":106},["ShallowReactive",2],{"content-query-bCjaMCkp72":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":100,"_id":101,"_source":102,"_file":103,"_stem":104,"_extension":105},"/blog/designing-a-future","blog",false,"","dEsigning a FuTure","We are surrounded by designs - Forms and Functions. And this is area that\nhugely interests me to think about and talk about. It has most of element\nwhich engages one’s analytical and artistic mind. Things like your furniture\nyou use, house you stay are the everyday objects which we deal with. Hence a\nproper design is very essential. But these everyday objects have such a large\nscope in our lives that the problem never seems to be completely solved by\nanyone. There are always a newly designed chairs or newly designed house which\nseems to solve our certain aspect of problems. Because this deals with both\nart and science, the scope for any designers to work on the problem is huge.","tag:blogger.com,1999:blog-8061911113731935185.post-4083531616985587336","designing-a-future","2012-08-25T13:35:00.001-07:00","post",{"type":15,"children":16,"toc":95},"root",[17,24,48,60,65,70,75,80,85,90],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":25,"props":26,"children":28},"h2",{"id":27},"http2bpblogspotcom-m5kiilbeybcudk26ro00liaaaaaaaabimvuhuobxjsr4s1600designing-a-futurejpghttp2bpblogspotcom-m5kiilbeybcudk26ro00liaaaaaaaabimvuhuobxjsr4s1600designing-a-futurejpg",[29,31,39,41,46],{"type":23,"value":30},"[![](",{"type":18,"tag":32,"props":33,"children":37},"a",{"href":34,"rel":35},"http://2.bp.blogspot.com/-M5KIILBEyBc/UDk26rO00LI/AAAAAAAABIM/VUHuOBXJSr4/s1600/designing-",[36],"nofollow",[38],{"type":23,"value":34},{"type":23,"value":40},"\na-\nfuture.jpg)](",{"type":18,"tag":32,"props":42,"children":44},{"href":34,"rel":43},[36],[45],{"type":23,"value":34},{"type":23,"value":47},"\na-future.jpg)",{"type":18,"tag":19,"props":49,"children":50},{},[51,53],{"type":23,"value":52},"Image Source :  ",{"type":18,"tag":32,"props":54,"children":57},{"href":55,"rel":56},"http://www.designindaba.com/",[36],[58],{"type":23,"value":59},"http://www.designindaba.com",{"type":18,"tag":19,"props":61,"children":62},{},[63],{"type":23,"value":64},"For example, we know that every industrial designer takes on the design of a\nchair. And everyone has their own take on it. It gives designers an\nopportunity to play with an idea around the chair. In parallel to the physical\nobject design, we have something called digital design.",{"type":18,"tag":19,"props":66,"children":67},{},[68],{"type":23,"value":69},"There are different aspects of digital designs as well. Just like chairs, we\nhave task management apps, project management apps, email apps and so on.\nThese apps are like fundamental forms of digital life and everyone uses one.\nNow in near future social networking apps are also going to be a must have\napp. There are thousands of productivity apps dealing with different aspect of\nit. Similarly there are many designers still working on that next great Email\nApps.",{"type":18,"tag":19,"props":71,"children":72},{},[73],{"type":23,"value":74},"Social networking sites have a lot of issue and this is mainly because of the\ndomination of these platforms by only few. Facebook, LinkedIn or Twitter will\nnever encourage anyone to play around with their platforms and take away the\nusers. Unlike email, where anyone can own a separate instance of their email\nserver, no one can have different aspect of their social graph in the\ninternet. It has to be either Facebook or Twitter.",{"type":18,"tag":19,"props":76,"children":77},{},[78],{"type":23,"value":79},"This is one of the biggest challenges in the future of our digital life that\nneeds a solutions. The major problem is that these different social networks\ndon’t communicate with each other like emails do. It has different concepts\nall together. For example you can send a mail from hotmail to any other mail\nserver. But you cannot send a message from Facebook to Twitter or LinkedIn.",{"type":18,"tag":19,"props":81,"children":82},{},[83],{"type":23,"value":84},"Now this might sound weird that why would one want to do that. But this also\nshows a difference in the way human personal identity exists in the Internet.\nIt exists in the form of ownership with other networks or platforms. You\ncannot have a different network of your own. We are already seeing an issue\nwith the existence of one powerful social network platforms. The ownership,\nthe privacy and data issue. One company owning and governing major part of\nyour digital life doesn’t sound fair.",{"type":18,"tag":19,"props":86,"children":87},{},[88],{"type":23,"value":89},"Can this be changed? I am not sure. Other networks like Diaspora seem to have\ntried to solve it with no avail. I think the solution can lie in the\nframework. For example every email you send or receive comes in a standard\nprotocol; hence all the services providing such services comply with it. This\nway there is standardization and variety of application and companies can\nexist around it – hotmail, yahoo, gmail and so many other independent.",{"type":18,"tag":19,"props":91,"children":92},{},[93],{"type":23,"value":94},"But in case of social network, there is no standard. The standards are only\nfixed and controlled by Facebook and Twitter. There is no protocol defined for\nit. But I believe that there needs to be a defined protocol. This way, many\nservices can exist and we can have lot more innovations. The idea is not\nstraight forward but there can certainly be a solution to it. I am not sure\nhow it will look and feel. But I am certain that such innovation will happen,\nas we are already seeing many independent companies tring to solve it.",{"title":7,"searchDepth":96,"depth":96,"links":97},2,[98],{"id":27,"depth":96,"text":99},"[![](http://2.bp.blogspot.com/-M5KIILBEyBc/UDk26rO00LI/AAAAAAAABIM/VUHuOBXJSr4/s1600/designing-\na-\nfuture.jpg)](http://2.bp.blogspot.com/-M5KIILBEyBc/UDk26rO00LI/AAAAAAAABIM/VUHuOBXJSr4/s1600/designing-\na-future.jpg)","markdown","content:blog:designing-a-future.md","content","blog/designing-a-future.md","blog/designing-a-future","md",1719046426623]