[{"data":1,"prerenderedAt":73},["ShallowReactive",2],{"content-query-T4WUsS6MdP":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":67,"_id":68,"_source":69,"_file":70,"_stem":71,"_extension":72},"/blog/on-failure","blog",false,"","On Failure","tag:blogger.com,1999:blog-8061911113731935185.post-7761063479998566347","on-failure","2008-09-13T22:31:00.000-07:00","post",{"type":14,"children":15,"toc":64},"root",[16,33,39,44,49,54,59],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://4.bp.blogspot.com/_UYUaEitRq54/SMyjAm4ryhI/AAAAAAAAABk/smgaMSvmdks/s1600-h/Jan01767.JPG",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://4.bp.blogspot.com/_UYUaEitRq54/SMyjAm4ryhI/AAAAAAAAABk/smgaMSvmdks/s400/Jan01767.JPG",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","Everyone is happy here, cause we won. We all enjoyed it very much. We\nsucceeded on something.",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"So what is it to be successful in Life? Does something has to certified for it\nto be claimed as success, and failure cause its uncertified or lets say\ncertified failure. Hmm. Have you thought about it? Reason we feel successful\nand the reason we feel failure. But its not so easy cause what we think is\ndominated, most of the time, by what others think of it. So we call for\nmajority to decide on our success. Ironically the majority wins, it is so\ncalled a Democratic View or Democratic ways.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"Is majority always the correct? But I don't want to discuss on that, what I am\ninterested is in the fear behind being unsuccessful in life. The fear that\nalways hunts us when we feel we are going down in life. I say, let us not\nfear. So easy isn't it? But it takes a hell lot of courage to think in this\nway, Or you can also say you have to be stupid enough not to know the risk.\nWell, which ever way we put it down, the fear is not going to be defined this\nway. But we can understand the origin of it and I really mean it.",{"type":17,"tag":18,"props":50,"children":51},{},[52],{"type":37,"value":53},"Inorder to understand your fear, you first have to change your prespective on\nsuccess. Well said. You may be shouting at me inside, \"Perspective. Huh.\nAnything you don't understand , people say change your perspective. What the\nhell is this perspective anyway?\" Well, I really cannot argue on that cause I\ncan't.",{"type":17,"tag":18,"props":55,"children":56},{},[57],{"type":37,"value":58},"Since your childhood, we have been taught to look only from one way, the good\nway, the right way and the way everyone looks. I am not encouraging people to\nbreak the rules but yes I am encouraging people to break the usual trend in\nthe thought process of human beings which is sometime so predictable.",{"type":17,"tag":18,"props":60,"children":61},{},[62],{"type":37,"value":63},"Personally, perspective is all that matters to me. For me failure is a way of\nlearning your limitations and building on your confidence and strength. When\nyou fail, try to see the reason behind it. And try to be true to your-self why\nyou failed. Now, this is very important. We are not true to ourself 90 percent\nof the time because, we need to answer to our ego. This EGO which resides in\nevery one of us. This EGO is the god father of ourself. Once you become true\nto yourself, any failure that you come across, you can smile at it store it\ninto your memory but don't hurt yourself in doing it. Just know that it is a\nfall among the millions that is going to come ahead. Just accept that, failure\ndoes not have any ends so, there is nothing to worry about it. Beileve me\neveryone of us know what is the right way, only thing is we bindfold ourself\nand lie to our EGO.",{"title":7,"searchDepth":65,"depth":65,"links":66},2,[],"markdown","content:blog:on-failure.md","content","blog/on-failure.md","blog/on-failure","md",1719049481130]