[{"data":1,"prerenderedAt":149},["ShallowReactive",2],{"content-query-J1OAE6vnwM":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":143,"_id":144,"_source":145,"_file":146,"_stem":147,"_extension":148},"/blog/source-and-noise","blog",false,"","Source and Noise","tag:blogger.com,1999:blog-8061911113731935185.post-545596355124834369","source-and-noise","2008-09-13T23:49:00.000-07:00","post",{"type":14,"children":15,"toc":140},"root",[16,32,45,64,69,81,86,93,98,110,115,120,125,130,135],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://3.bp.blogspot.com/_UYUaEitRq54/SMy7AGfo_8I/AAAAAAAAACc/91CKYUiGiTg/s1600-h/sonyapple.jpg",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":31},"br",{},[],{"type":17,"tag":18,"props":33,"children":34},{},[35],{"type":17,"tag":22,"props":36,"children":39},{"href":37,"rel":38},"http://3.bp.blogspot.com/_UYUaEitRq54/SMy38xYpJWI/AAAAAAAAACU/sg4EetlUeQg/s1600-h/compareWebAnalyticsUK.jpg",[26],[40],{"type":17,"tag":41,"props":42,"children":44},"img",{"alt":7,"src":43},"http://3.bp.blogspot.com/_UYUaEitRq54/SMy38xYpJWI/AAAAAAAAACU/sg4EetlUeQg/s400/compareWebAnalyticsUK.jpg",[],{"type":17,"tag":18,"props":46,"children":47},{},[48,51,54,56,62],{"type":49,"value":50},"text","lets look at the same graph again. But this time, look at each individual\ncurves and you will find something very interesting.[",{"type":17,"tag":29,"props":52,"children":53},{},[],{"type":49,"value":55},"\n](",{"type":17,"tag":22,"props":57,"children":60},{"href":58,"rel":59},"http://4.bp.blogspot.com/_UYUaEitRq54/SMy3sVxEubI/AAAAAAAAACM/VyKXkpAb-",[26],[61],{"type":49,"value":58},{"type":49,"value":63},"\neA/s1600-h/DellHp.jpeg)",{"type":17,"tag":18,"props":65,"children":66},{},[67],{"type":49,"value":68},"Look at how the graph shoots up at the end of each year. This does not happen\nonly for sony but for every other graph. Can you guess why? May be just may be\nit is because of the new model that appears at the end of each year. Or may be\nsome thing else. The art of analysing goes into not jumping at any conclusion\nwhen you don't have enough data. Its good to assume but not be guaranteed\nabout it. So what do you do? Well, instead of making more assumption lets look\nat more data. You may be correct or totally wrong.",{"type":17,"tag":18,"props":70,"children":71},{},[72,74,79],{"type":49,"value":73},"![](",{"type":17,"tag":22,"props":75,"children":77},{"href":58,"rel":76},[26],[78],{"type":49,"value":58},{"type":49,"value":80},"\neA/s400/DellHp.jpeg)",{"type":17,"tag":18,"props":82,"children":83},{},[84],{"type":49,"value":85},"First thing in analysing is knowing that you are looking at the correct graph\nand that you are comparing the correct things. For example, the four names\n(dell,sony,hp,apple) looks very similar, but they aren't. You don't have any\nmobile phones of hp, as far as I know and neither do dell. So is it right for\nus to be categorising them in the same domain. No! You can also see above that\ndell and hp has a lower and different trend than that of sony and apple.",{"type":17,"tag":18,"props":87,"children":88},{},[89],{"type":17,"tag":41,"props":90,"children":92},{"alt":7,"src":91},"http://3.bp.blogspot.com/_UYUaEitRq54/SMy7AGfo_8I/AAAAAAAAACc/91CKYUiGiTg/s400/sonyapple.jpg",[],{"type":17,"tag":18,"props":94,"children":95},{},[96],{"type":49,"value":97},"So here is the graph of only sony and apple. They seem to have similar trend\nbut the levels are not still the same. The only thing that is 100% certain is\nthat sony is more popular among google users. I have to be as accurate as\npossible because not every one's search engine is google.",{"type":17,"tag":18,"props":99,"children":100},{},[101],{"type":17,"tag":22,"props":102,"children":105},{"href":103,"rel":104},"http://2.bp.blogspot.com/_UYUaEitRq54/SMy8If7qfNI/AAAAAAAAACk/nZuxkFNDoDA/s1600-h/SonyIpod.jpg",[26],[106],{"type":17,"tag":41,"props":107,"children":109},{"alt":7,"src":108},"http://2.bp.blogspot.com/_UYUaEitRq54/SMy8If7qfNI/AAAAAAAAACk/nZuxkFNDoDA/s400/SonyIpod.jpg",[],{"type":17,"tag":18,"props":111,"children":112},{},[113],{"type":49,"value":114},"Wow, look at this one. When I am comparing ipod and sony they are head to\nhead. Strange. Why didn't the 'apple' search show the similar result. Apple is\nsame as with mac or ipod. Hmm.",{"type":17,"tag":18,"props":116,"children":117},{},[118],{"type":49,"value":119},"This shows and proves my one point which is - Have full confidence in your\ndata first. With different search words we will have different results. So\nlets not go random but systematic in it. Example, 'apple' is not the correct\nsearch word to compare two companies cause apple is a general word with many\nmeanings, so this result of apple doesn't mean that it is the apple company.\nIn engineering term, it means correct your source of information and use a\nvery good filtering mechanism to insure that you are getting particularly what\nyou are searching for. This is not an easy task, remember the source is very\nvery messed up. Thus we have to engineer our way of analysing it. From the\nabove graph we can only assume and also have fun.",{"type":17,"tag":18,"props":121,"children":122},{},[123],{"type":49,"value":124},"The next thing that I wanted to concentrate is the randomness or the noise in\nit. The zigzag of the graph means noise to me cause I don't want it. I want a\nsmooth graph with some logic, not vibrating one unless I am looking at the\noscillating system. In this case, it seems people's interest are oscillating,\nso may be it is an oscillating system. But even there, there is a noise in the\ngraph and we need to get rid of it, in such a way that we do not ignore the\nreal information.",{"type":17,"tag":18,"props":126,"children":127},{},[128],{"type":49,"value":129},"Looking at a noise, for me, started a long time back when I use to work with\nmy friend Ansu. When every we gave an input to a electronic system, we had a\npeculiarly annoying set of noise. We had less interest in the signal cause\nthat is what we expected but the noise its so unexpected. So we would go head\non with ourselves to eliminate it. But alas, we don't have a practical way of\ndeleting it but only reducing it. The reason is when you are dealing with the\nnoise, you are also dealing with the information. So you have a negative\nfeedback effect.",{"type":17,"tag":18,"props":131,"children":132},{},[133],{"type":49,"value":134},"Surely, these seems less of an business problem than a hardcore engineering\nproblem. But hold on with that thought. We are dealing with a business problem\nso our noise also has that characteristics. So we must have a business model\nwhich could be in any domain. Then we have to deal with them accordingly.",{"type":17,"tag":18,"props":136,"children":137},{},[138],{"type":49,"value":139},"And it is our jobs to make sure that we have a reliable graph from a reliable\nsource with less noise. The task is very frustratingly difficult one as you\ndon't know where to start form. So make sure, you have your goal fixed, so you\nknow what you are looking for. If you don't know what you are looking for you\ncan't find it no matter how long you search.",{"title":7,"searchDepth":141,"depth":141,"links":142},2,[],"markdown","content:blog:source-and-noise.md","content","blog/source-and-noise.md","blog/source-and-noise","md",1719977875040]