[{"data":1,"prerenderedAt":78},["ShallowReactive",2],{"content-query-ZDpipu23sm":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":72,"_id":73,"_source":74,"_file":75,"_stem":76,"_extension":77},"/blog/vision","blog",false,"","Vision","tag:blogger.com,1999:blog-8061911113731935185.post-3941758717064493011","vision","2008-09-20T02:51:00.000-07:00","post",{"type":14,"children":15,"toc":69},"root",[16,33,39,44,49,54,59,64],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://4.bp.blogspot.com/_UYUaEitRq54/SNTIHAIxmgI/AAAAAAAAADI/UDJxzl90zqU/s1600-h/DSC00057.JPG",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://4.bp.blogspot.com/_UYUaEitRq54/SNTIHAIxmgI/AAAAAAAAADI/UDJxzl90zqU/s320/DSC00057.JPG",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","Each of us start in a Life with an open mind and a hopeful dream. Some how or\nthe other, as we go along the way, we start focusing on something, something\nthat seems so important to us. I don't know what this thing is, neither do i\nknow its importance. But its true that somehow we start to accept the changes\nthat is going around. Slowly and steadily.",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"Its amazing how people decide what they want to do and how they want to live.\nWe start by learning the basics and go focusing into it for the search of real\ntruth. But somehow it happened opposite for me. In every stage, as I was\nmoving ahead with my education, I started getting more confused. I had more\nquestions than before. Well it happens all the time and to everyone of us. The\nvision started getting bigger. I started having more subjects as my favourites\nthan before. But normally it doesn't happen this way. Normally we get narrower\nand narrower in our thought. We keeping branching ourselves and finally end up\non the tip of one of the branches. We play a game of choices with ourselves.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"The reason, I start writing with a picture is because we first see things and\nthen ask ourselve a quesiton and try to figure out the solution. That happens\nto be our thought process, observe and then think. One of my friend told me\nnot to think so much otherwise I might turn into a philosopher. Hmm\nPHILOSPHER. \"Someone who thinks.\"",{"type":17,"tag":18,"props":50,"children":51},{},[52],{"type":37,"value":53},"But I want to say that I am not discussing on the perception of human minds, I\nam not talking on the question of knowledge and consiousness. I am simply\npointing out the facts that puzzles me. I consider myself a child who is\nconfused by the way we live and the way world exists in itself as a whole. Its\nsimple as that. I can't understand it.",{"type":17,"tag":18,"props":55,"children":56},{},[57],{"type":37,"value":58},"Every one has faced this statement - \"welcome to the real world.\" You pass\nyour tenth grade and your relatives will tell you ,\"Be careful you are\nventuring into the real word.\" But alash, you find out that this isn't, cause\nyour teachers will tell you, \"this is a preparation for the real world and the\nnot the real world it self.\" So now you are totally confused. Years passes by\nand you are finally in your bachelor and still you are told the same. You pass\nyour bachelor and damn again you are told the same. Seems to be living in an\nillusion.",{"type":17,"tag":18,"props":60,"children":61},{},[62],{"type":37,"value":63},"So what is this real world anyway? I suspect if it even exists. Aren't we all\nliving in the same world? May be and also may not be. This is where I am\nstarting to think. The world as seen by a child and a world as seen by an\nadult is completely different. Am I wrong? So.... can a childs vision be of\nany importance to the world, the world which is in itself relative to each one\nof us. So I sit wondering what I thought about the world when I was a child,\nmy dreams as it was then and as it is now.",{"type":17,"tag":18,"props":65,"children":66},{},[67],{"type":37,"value":68},"And there is only one thing that is common. Even then and even now, I am still\nconfused. Cannot clearly see the bigger picture. When will this vision of mine\nwill be clear and focused. But this focus is not like the one found in our\ncamera lenes, cause it can only focus at particular distance. I am talking\nabout the focus which is everywhere and all over. Crystal and Clear. May be,\nit will never be but still I want to ask questions to myself, simple plain\nquestion.",{"title":7,"searchDepth":70,"depth":70,"links":71},2,[],"markdown","content:blog:vision.md","content","blog/vision.md","blog/vision","md",1719998783784]