[{"data":1,"prerenderedAt":90},["ShallowReactive",2],{"content-query-uCdcRUmKtf":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":84,"_id":85,"_source":86,"_file":87,"_stem":88,"_extension":89},"/blog/perspective","blog",false,"","Perspective","tag:blogger.com,1999:blog-8061911113731935185.post-3101257943635356889","perspective","2008-09-12T06:05:00.000-07:00","post",{"type":14,"children":15,"toc":81},"root",[16,33,39,44,49,54,59,64,69],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://4.bp.blogspot.com/_UYUaEitRq54/SMpqIouhjSI/AAAAAAAAABU/K0AwaMVYolM/s1600-h/DSC04288.JPG",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://4.bp.blogspot.com/_UYUaEitRq54/SMpqIouhjSI/AAAAAAAAABU/K0AwaMVYolM/s400/DSC04288.JPG",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","Look at this picture very carefully. It was taken a year back when I was on my\nfield trip to one of the hilly villages in Nepal (Richowk). I was there for a\ncase study on Solar Power System.",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"I stood here in this particular spot for about some minutes and it totally\nchanged my view on the concept of development. And mind you, I was there only\nfor a minute but those minutes were too powerful for me.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"Look at the river winding itself around the land and making its way. And if\nyou look closely, you will see Nepal's national highway too, winding along\nwith the river. Following the nature seems so vivid and strong here.",{"type":17,"tag":18,"props":50,"children":51},{},[52],{"type":37,"value":53},"One may wonder why is the river winding itself and not going straight and same\ngoes to the highway. WHY? Just why does it have to wind itself. Even nature\nseems helpless to its own structure. Even nature is finding difficulties in\nover-coming itself. But as the scientific reasoning goes, the river will\nultimately take the short-cut and so will the roads. So are we waiting for the\nriver to make the first move?",{"type":17,"tag":18,"props":55,"children":56},{},[57],{"type":37,"value":58},"What if we don't wait and bombard the whole mass of land with bombs and make\nthe way for the river. Isn't that possible? I think it is. But just a second.\nShould we do it? Hmm. Its a same kind of ethical questions that you ask now\nand then again to yourself. So what do we do? Confused. Ya I am full of\nconfusion. So lets ask ourself a new question. Is it necessary to have a road\nthat goes straight through the hills. Well, yes I think. It will make the\njourney fast. But how much capital do you think must be invested to attain\nthis. May be, we can do something better with it then bombarding the place and\nif you are really in hurry, I suggest taking a plane. Well, may be well said.",{"type":17,"tag":18,"props":60,"children":61},{},[62],{"type":37,"value":63},"There is philosophy which says go with the nature and not against it. Because\nif you go against it, you distrub the whole balance of the nature. Imagine in\nthis case, our one stupid step to make a straight road may have impact on the\npeople staying there. Their usual life-style will be distrubed. But I am not\narguing that lets not do it. What I mean is go with the nature and it will\nguide you through. Trying to straighten the river, you may be bending the\nnature. Think about it.",{"type":17,"tag":18,"props":65,"children":66},{},[67],{"type":37,"value":68},"But everyone has differnt way of thinking. May be not everyone will follow my\nlogic cause we are made that way. We have multi-dimensional perspective. Even\nthough we are looking at things from the same angle physically, your mind\nseems to be in totally different dimension. Perplexed and Amazed, I can only\nsay when you do realize the truth make sure we follow it without fear.",{"type":17,"tag":18,"props":70,"children":71},{},[72],{"type":17,"tag":22,"props":73,"children":76},{"href":74,"rel":75},"http://3.bp.blogspot.com/_UYUaEitRq54/SMpp04gDrwI/AAAAAAAAABM/UJIHKDAszG0/s1600-h/DSC04288.JPG",[26],[77],{"type":17,"tag":78,"props":79,"children":80},"br",{},[],{"title":7,"searchDepth":82,"depth":82,"links":83},2,[],"markdown","content:blog:perspective.md","content","blog/perspective.md","blog/perspective","md",1719997687644]