[{"data":1,"prerenderedAt":58},["ShallowReactive",2],{"content-query-PDAeeHTL35":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":52,"_id":53,"_source":54,"_file":55,"_stem":56,"_extension":57},"/blog/destiny-over-choice","blog",false,"","Destiny over Choice","I think I was born to be an Industrial designer. How do I know? I don't, but I\njust feel it that way though I am not, yet. In similar ways I could say, I was\neven born to be an Entrepreneur. But ironically, I never knew about these\nfields until few years back. This happened cause I stopped the speeding clock\nof my life. I took off from a steady pitch road started venturing into no\nman's land. I feel glad that I did.","tag:blogger.com,1999:blog-8061911113731935185.post-5984471198847233598","destiny-over-choice","2011-02-21T11:09:00.000-08:00","post",{"type":15,"children":16,"toc":49},"root",[17,24,29,34,39,44],{"type":18,"tag":19,"props":20,"children":21},"element","p",{},[22],{"type":23,"value":9},"text",{"type":18,"tag":19,"props":25,"children":26},{},[27],{"type":23,"value":28},"Everyone is not born with an opportunity to know it all before hand. And not\nevery society has a condition where one can find their destiny. So, I feel\nglad that I was able to find my dream. To find a thing where you could give\nall your life, its like finding a love of your life.",{"type":18,"tag":19,"props":30,"children":31},{},[32],{"type":23,"value":33},"My understanding of myself begins with a realization of my interests and my\nchoices. Irrespective of what you have been doing so far, you need to be sure\nof your likes and dislikes. It takes an immense effort for anyone to choose\ntheir choice, I am not able to know why? A wise person have told that you are\ndefined by things that you don't do. There is an immense noise in today's\nworld blocking one from figuring out clearly on what they want to do and don't\nwant to do.",{"type":18,"tag":19,"props":35,"children":36},{},[37],{"type":23,"value":38},"World is certainly a very noisy place and getting through it is the most\ndifficult task of all. From the very beginning, we are told about the right\nand wrong, and about our moral values, only to be proven wrong latter when the\nreality hits you hard. Finding factual and authentic information has become\ndifficult with time.",{"type":18,"tag":19,"props":40,"children":41},{},[42],{"type":23,"value":43},"The satisfaction that you receive after reading a good book or watching a good\nmovie or listening to a good music is unparalleled to anything, why? Because\nno matter what people say and no matter what critics say, good thing always\nmatters. Good thing are never justified, they are just accepted and lived. You\nfind yourself blessed to have found your passion.",{"type":18,"tag":19,"props":45,"children":46},{},[47],{"type":23,"value":48},"So, I am still questioning over this conundrum, the choice of destiny over\nchoice. There is a big difference between flowing along the current of a river\nand walking against it.",{"title":7,"searchDepth":50,"depth":50,"links":51},2,[],"markdown","content:blog:destiny-over-choice.md","content","blog/destiny-over-choice.md","blog/destiny-over-choice","md",1719047577862]