[{"data":1,"prerenderedAt":68},["ShallowReactive",2],{"content-query-7nVC8MmUCG":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"postId":9,"slug":10,"publishedDate":11,"layout":12,"body":13,"_type":62,"_id":63,"_source":64,"_file":65,"_stem":66,"_extension":67},"/blog/not-customer-loyalty","blog",false,"","NOT Customer Loyalty","tag:blogger.com,1999:blog-8061911113731935185.post-5234594368462905326","not-customer-loyalty","2009-03-27T02:00:00.000-07:00","post",{"type":14,"children":15,"toc":59},"root",[16,33,39,44,49,54],{"type":17,"tag":18,"props":19,"children":20},"element","p",{},[21],{"type":17,"tag":22,"props":23,"children":27},"a",{"href":24,"rel":25},"http://1.bp.blogspot.com/_UYUaEitRq54/ScybGlYkwxI/AAAAAAAAAks/l_oaPD8Hpn4/s1600-h/infin.png",[26],"nofollow",[28],{"type":17,"tag":29,"props":30,"children":32},"img",{"alt":7,"src":31},"http://1.bp.blogspot.com/_UYUaEitRq54/ScybGlYkwxI/AAAAAAAAAks/l_oaPD8Hpn4/s400/infin.png",[],{"type":17,"tag":18,"props":34,"children":35},{},[36],{"type":37,"value":38},"text","Its odd to have such an odd title. By that, I am trying to address one issue\nthat we face regarding the customer's loyalty and their expectation from us.\nWe have always argued about the need for providing better services to the\nloyal customer and bringing new businesses. Here, I will try to put a scenario\nwhere you need to chose between the loyalty and profit. Ok, lets go.",{"type":17,"tag":18,"props":40,"children":41},{},[42],{"type":37,"value":43},"Imagine. Just imagine, you own a small restaurant. You have nominal profit and\neverything is going fine. You have regular customers who visit you regularly.\nLife's going fine and you have no complains. Then one day.",{"type":17,"tag":18,"props":45,"children":46},{},[47],{"type":37,"value":48},"The day is pleasant, weather is just right and its a fresh start for your\nbusiness. Some groups of tourist visit your restaurant and orders some food.\nYou are delighted by the mass and by the luck. Suddenly you realise that food\nstock is small. It is going to be difficult for you to cater all of them. You\norder your cook to make more. The new visitors orders more. The consumption\nincreases and your rate of work is low. But you are managing. Suddenly, your\nloyal customer - the one who regularly visits - comes to your restaurant. Now.",{"type":17,"tag":18,"props":50,"children":51},{},[52],{"type":37,"value":53},"Now, what would be your action. Would you divert your resources to cater your\nloyal customer or your newly found tourists, from where you are obviously\ngoing to gain more. Upsetting your loyal customer would hamper your balanced\nbusiness and letting the opportunity go by would surely hurt you.",{"type":17,"tag":18,"props":55,"children":56},{},[57],{"type":37,"value":58},"From my personal experience, people tend to play safe by rejecting the\nopportunity. Is that justified? Or shall I say, you must have gone for new\nshort term opportunities, to give that boost you need in your business? Hmm.\nIt might be a question of morality and loyalty. But just give a thought.",{"title":7,"searchDepth":60,"depth":60,"links":61},2,[],"markdown","content:blog:not-customer-loyalty.md","content","blog/not-customer-loyalty.md","blog/not-customer-loyalty","md",1719997687550]