[{"data":1,"prerenderedAt":111},["ShallowReactive",2],{"content-query-QfKkBfojSO":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"postId":10,"slug":11,"publishedDate":12,"layout":13,"body":14,"_type":105,"_id":106,"_source":107,"_file":108,"_stem":109,"_extension":110},"/blog/creative-product-development-process","blog",false,"","Creative Product Development Process","An interesting topic, as this means a lot to me and my every instances of\nlife. Product is far more different then Service, in terms of engagement with\ncustomers and expectations. I find it similar to animated movies versus actor-\nacted movies. There are certain freedoms in making animated movies, due to\nfreedom of choice of characters, whereas in case of actor-acted movies you\nhave to deal with the personality of the actor before you even go to explore\nthe character of the story. I chuckle every time I remember one of the\nstatement from George Lucas, “I like working with animated characters as I\nhate dealing with people.” Off course, that cannot be the only reason for\nmaking animated series, because at the end it’s about great story telling. In\ncase of products and services, it’s all about solving problems and adding\nvalue. What differentiates is how you want to approach it.","tag:blogger.com,1999:blog-8061911113731935185.post-5407474529233857516","creative-product-development-process","2011-07-15T23:46:00.000-07:00","post",{"type":15,"children":16,"toc":100},"root",[17,22,28,52,57,62,67,72,77,82,87],{"type":18,"tag":19,"props":20,"children":21},"element","hr",{},[],{"type":18,"tag":23,"props":24,"children":25},"p",{},[26],{"type":27,"value":9},"text",{"type":18,"tag":29,"props":30,"children":32},"h2",{"id":31},"httpwwwbrainpickingsorgwp-contentuploads200904pureprocess2pnghttpwwwbrainpickingsorgwp-contentuploads200904pureprocess2png",[33,35,43,45,50],{"type":27,"value":34},"[![](",{"type":18,"tag":36,"props":37,"children":41},"a",{"href":38,"rel":39},"http://www.brainpickings.org/wp-",[40],"nofollow",[42],{"type":27,"value":38},{"type":27,"value":44},"\ncontent/uploads/2009/04/pureprocess2.png)](",{"type":18,"tag":36,"props":46,"children":48},{"href":38,"rel":47},[40],[49],{"type":27,"value":38},{"type":27,"value":51},"\ncontent/uploads/2009/04/pureprocess2.png)",{"type":18,"tag":23,"props":53,"children":54},{},[55],{"type":27,"value":56},"Source : brainpickings.org",{"type":18,"tag":23,"props":58,"children":59},{},[60],{"type":27,"value":61},"So let me dwell into the aspect of product development process. It starts, I\nthink, with etch.   Etch, is important because it definitely shows you the\narea of problem and a point where value can be added. The greater the ETCH,\nthe great the value the product can add.",{"type":18,"tag":23,"props":63,"children":64},{},[65],{"type":27,"value":66},"Once that is identified, the whole system starts to reveal itself in terms of\nsystem variables and controls variables. And this whole process is gratifying\nin its own terms. But I am not going go through all these process of\nidentifying variables and implementing them as a form and function in terms of\nsoftware or hardware. What I want to explore is this development process,\nwhere the product is still not matured but is on its way of becoming the\nrequired solutions.",{"type":18,"tag":23,"props":68,"children":69},{},[70],{"type":27,"value":71},"Imagine, designing a building (building structure is the perfect example for\nme in terms of creativity and engineering solutions). It has aspect of\naesthetics and ingenuity of engineered solutions, making a perfect combo for\nany kind of analysis. And the variable becomes the flow of nature, resources\nand humans in and out. But there is one aspect missing and that’s the mass\nproduction. Unlike products, building becomes the defining aspect of itself\nattracting visitors to marvel its engineering feet. But product on the other\nhand, reaches to mass through calculated production and supply chain. It has\naspect of packaging, pricing, distribution, sales and so on. On the contrary,\nmodern web solutions or products are much like designing buildings rather than\nproducts. It’s about attracting visitors and maintaining their flow in the\nsystem. Traditionally software products were too packaged and distributed, but\nnow it’s much simpler to reach out to mass.  Today, internet is a platform\nwhere you need to build a software or solution, similar to constructing a\nhouse. It has to be aesthetically appealing, functionally simple and lot of\nvalue addition.",{"type":18,"tag":23,"props":73,"children":74},{},[75],{"type":27,"value":76},"Difference between buildings and software lies in the risk that you can take\non, which means you cannot afford to do lots of trial and error tests with\nbuilding as with web platforms. In case of buildings, the evolution happens in\nslow and steady way, encouraged with lots of off shore research and testing.\nSo I would like to see, web product design as more than just designing a\nbuilding, but designing a community and a society. Because in case of\ndesigning landscapes and community you have lot more flexibility, in terms of\nexperimenting with elements of society. It has to have every aspect of a\ncommunity, especially after the social media revolution.",{"type":18,"tag":23,"props":78,"children":79},{},[80],{"type":27,"value":81},"Now, why is it that it’s a creative process and not just stacking of\nfunctionality? Well, it doesn’t have to be. Back to my saying, that it depend\nhow you approach and the vision behind it. But I am more inclined into taking\nit as a creative process, as that happens to be my passion.",{"type":18,"tag":23,"props":83,"children":84},{},[85],{"type":27,"value":86},"So, can I say it’s like movie making experience? Hmm may be not entirely. But\nthere are certain aspect of film making that can be implemented into the\nproduct development cycle, especially the scripting part. Script writing is\ncertainly the blue print of films, so I think even a good product would have\nmore benefit if a basic script can be formed in terms of actors, plots and\nfunctionality. Lately, I have tried to go through some of the standard scripts\nof movies, I found them expressive in terms of scene description and how that\nhelps to take the story forward. In similar, way a good description of a\nproduct feature in terms of user perspective and system perspective would be\ngreat. May be characters could be users, interaction and system services.\nAhh... ya it’s all so interesting to feel about this creative process of\ndealing with lot of variables, but it’s better not to get into process so much\nthat you forget the main pictures, that solving the problem.",{"type":18,"tag":23,"props":88,"children":89},{},[90,92,98],{"type":27,"value":91},"Don't forget to see the post on [GOD\nCOMPLEX](",{"type":18,"tag":36,"props":93,"children":96},{"href":94,"rel":95},"http://www.bexdeep.com/2011/07/tim-harford-trial-error-and-god-",[40],[97],{"type":27,"value":94},{"type":27,"value":99},"\ncomplex.html), its a great talk on trial and error process.",{"title":7,"searchDepth":101,"depth":101,"links":102},2,[103],{"id":31,"depth":101,"text":104},"[![](http://www.brainpickings.org/wp-\ncontent/uploads/2009/04/pureprocess2.png)](http://www.brainpickings.org/wp-\ncontent/uploads/2009/04/pureprocess2.png)","markdown","content:blog:creative-product-development-process.md","content","blog/creative-product-development-process.md","blog/creative-product-development-process","md",1719998782653]